{"______": 0, "A_____": 1, "T_____": 2, "G_____": 3, "C_____": 4, "AA____": 5, "AT____": 6, "AG____": 7, "AC____": 8, "TA____": 9, "TT____": 10, "TG____": 11, "TC____": 12, "GA____": 13, "GT____": 14, "GG____": 15, "GC____": 16, "CA____": 17, "CT____": 18, "CG____": 19, "CC____": 20, "AAA___": 21, "AAT___": 22, "AAG___": 23, "AAC___": 24, "ATA___": 25, "ATT___": 26, "ATG___": 27, "ATC___": 28, "AGA___": 29, "AGT___": 30, "AGG___": 31, "AGC___": 32, "ACA___": 33, "ACT___": 34, "ACG___": 35, "ACC___": 36, "TAA___": 37, "TAT___": 38, "TAG___": 39, "TAC___": 40, "TTA___": 41, "TTT___": 42, "TTG___": 43, "TTC___": 44, "TGA___": 45, "TGT___": 46, "TGG___": 47, "TGC___": 48, "TCA___": 49, "TCT___": 50, "TCG___": 51, "TCC___": 52, "GAA___": 53, "GAT___": 54, "GAG___": 55, "GAC___": 56, "GTA___": 57, "GTT___": 58, "GTG___": 59, "GTC___": 60, "GGA___": 61, "GGT___": 62, "GGG___": 63, "GGC___": 64, "GCA___": 65, "GCT___": 66, "GCG___": 67, "GCC___": 68, "CAA___": 69, "CAT___": 70, "CAG___": 71, "CAC___": 72, "CTA___": 73, "CTT___": 74, "CTG___": 75, "CTC___": 76, "CGA___": 77, "CGT___": 78, "CGG___": 79, "CGC___": 80, "CCA___": 81, "CCT___": 82, "CCG___": 83, "CCC___": 84, "AAAA__": 85, "AAAT__": 86, "AAAG__": 87, "AAAC__": 88, "AATA__": 89, "AATT__": 90, "AATG__": 91, "AATC__": 92, "AAGA__": 93, "AAGT__": 94, "AAGG__": 95, "AAGC__": 96, "AACA__": 97, "AACT__": 98, "AACG__": 99, "AACC__": 100, "ATAA__": 101, "ATAT__": 102, "ATAG__": 103, "ATAC__": 104, "ATTA__": 105, "ATTT__": 106, "ATTG__": 107, "ATTC__": 108, "ATGA__": 109, "ATGT__": 110, "ATGG__": 111, "ATGC__": 112, "ATCA__": 113, "ATCT__": 114, "ATCG__": 115, "ATCC__": 116, "AGAA__": 117, "AGAT__": 118, "AGAG__": 119, "AGAC__": 120, "AGTA__": 121, "AGTT__": 122, "AGTG__": 123, "AGTC__": 124, "AGGA__": 125, "AGGT__": 126, "AGGG__": 127, "AGGC__": 128, "AGCA__": 129, "AGCT__": 130, "AGCG__": 131, "AGCC__": 132, "ACAA__": 133, "ACAT__": 134, "ACAG__": 135, "ACAC__": 136, "ACTA__": 137, "ACTT__": 138, "ACTG__": 139, "ACTC__": 140, "ACGA__": 141, "ACGT__": 142, "ACGG__": 143, "ACGC__": 144, "ACCA__": 145, "ACCT__": 146, "ACCG__": 147, "ACCC__": 148, "TAAA__": 149, "TAAT__": 150, "TAAG__": 151, "TAAC__": 152, "TATA__": 153, "TATT__": 154, "TATG__": 155, "TATC__": 156, "TAGA__": 157, "TAGT__": 158, "TAGG__": 159, "TAGC__": 160, "TACA__": 161, "TACT__": 162, "TACG__": 163, "TACC__": 164, "TTAA__": 165, "TTAT__": 166, "TTAG__": 167, "TTAC__": 168, "TTTA__": 169, "TTTT__": 170, "TTTG__": 171, "TTTC__": 172, "TTGA__": 173, "TTGT__": 174, "TTGG__": 175, "TTGC__": 176, "TTCA__": 177, "TTCT__": 178, "TTCG__": 179, "TTCC__": 180, "TGAA__": 181, "TGAT__": 182, "TGAG__": 183, "TGAC__": 184, "TGTA__": 185, "TGTT__": 186, "TGTG__": 187, "TGTC__": 188, "TGGA__": 189, "TGGT__": 190, "TGGG__": 191, "TGGC__": 192, "TGCA__": 193, "TGCT__": 194, "TGCG__": 195, "TGCC__": 196, "TCAA__": 197, "TCAT__": 198, "TCAG__": 199, "TCAC__": 200, "TCTA__": 201, "TCTT__": 202, "TCTG__": 203, "TCTC__": 204, "TCGA__": 205, "TCGT__": 206, "TCGG__": 207, "TCGC__": 208, "TCCA__": 209, "TCCT__": 210, "TCCG__": 211, "TCCC__": 212, "GAAA__": 213, "GAAT__": 214, "GAAG__": 215, "GAAC__": 216, "GATA__": 217, "GATT__": 218, "GATG__": 219, "GATC__": 220, "GAGA__": 221, "GAGT__": 222, "GAGG__": 223, "GAGC__": 224, "GACA__": 225, "GACT__": 226, "GACG__": 227, "GACC__": 228, "GTAA__": 229, "GTAT__": 230, "GTAG__": 231, "GTAC__": 232, "GTTA__": 233, "GTTT__": 234, "GTTG__": 235, "GTTC__": 236, "GTGA__": 237, "GTGT__": 238, "GTGG__": 239, "GTGC__": 240, "GTCA__": 241, "GTCT__": 242, "GTCG__": 243, "GTCC__": 244, "GGAA__": 245, "GGAT__": 246, "GGAG__": 247, "GGAC__": 248, "GGTA__": 249, "GGTT__": 250, "GGTG__": 251, "GGTC__": 252, "GGGA__": 253, "GGGT__": 254, "GGGG__": 255, "GGGC__": 256, "GGCA__": 257, "GGCT__": 258, "GGCG__": 259, "GGCC__": 260, "GCAA__": 261, "GCAT__": 262, "GCAG__": 263, "GCAC__": 264, "GCTA__": 265, "GCTT__": 266, "GCTG__": 267, "GCTC__": 268, "GCGA__": 269, "GCGT__": 270, "GCGG__": 271, "GCGC__": 272, "GCCA__": 273, "GCCT__": 274, "GCCG__": 275, "GCCC__": 276, "CAAA__": 277, "CAAT__": 278, "CAAG__": 279, "CAAC__": 280, "CATA__": 281, "CATT__": 282, "CATG__": 283, "CATC__": 284, "CAGA__": 285, "CAGT__": 286, "CAGG__": 287, "CAGC__": 288, "CACA__": 289, "CACT__": 290, "CACG__": 291, "CACC__": 292, "CTAA__": 293, "CTAT__": 294, "CTAG__": 295, "CTAC__": 296, "CTTA__": 297, "CTTT__": 298, "CTTG__": 299, "CTTC__": 300, "CTGA__": 301, "CTGT__": 302, "CTGG__": 303, "CTGC__": 304, "CTCA__": 305, "CTCT__": 306, "CTCG__": 307, "CTCC__": 308, "CGAA__": 309, "CGAT__": 310, "CGAG__": 311, "CGAC__": 312, "CGTA__": 313, "CGTT__": 314, "CGTG__": 315, "CGTC__": 316, "CGGA__": 317, "CGGT__": 318, "CGGG__": 319, "CGGC__": 320, "CGCA__": 321, "CGCT__": 322, "CGCG__": 323, "CGCC__": 324, "CCAA__": 325, "CCAT__": 326, "CCAG__": 327, "CCAC__": 328, "CCTA__": 329, "CCTT__": 330, "CCTG__": 331, "CCTC__": 332, "CCGA__": 333, "CCGT__": 334, "CCGG__": 335, "CCGC__": 336, "CCCA__": 337, "CCCT__": 338, "CCCG__": 339, "CCCC__": 340, "AAAAA_": 341, "AAAAT_": 342, "AAAAG_": 343, "AAAAC_": 344, "AAATA_": 345, "AAATT_": 346, "AAATG_": 347, "AAATC_": 348, "AAAGA_": 349, "AAAGT_": 350, "AAAGG_": 351, "AAAGC_": 352, "AAACA_": 353, "AAACT_": 354, "AAACG_": 355, "AAACC_": 356, "AATAA_": 357, "AATAT_": 358, "AATAG_": 359, "AATAC_": 360, "AATTA_": 361, "AATTT_": 362, "AATTG_": 363, "AATTC_": 364, "AATGA_": 365, "AATGT_": 366, "AATGG_": 367, "AATGC_": 368, "AATCA_": 369, "AATCT_": 370, "AATCG_": 371, "AATCC_": 372, "AAGAA_": 373, "AAGAT_": 374, "AAGAG_": 375, "AAGAC_": 376, "AAGTA_": 377, "AAGTT_": 378, "AAGTG_": 379, "AAGTC_": 380, "AAGGA_": 381, "AAGGT_": 382, "AAGGG_": 383, "AAGGC_": 384, "AAGCA_": 385, "AAGCT_": 386, "AAGCG_": 387, "AAGCC_": 388, "AACAA_": 389, "AACAT_": 390, "AACAG_": 391, "AACAC_": 392, "AACTA_": 393, "AACTT_": 394, "AACTG_": 395, "AACTC_": 396, "AACGA_": 397, "AACGT_": 398, "AACGG_": 399, "AACGC_": 400, "AACCA_": 401, "AACCT_": 402, "AACCG_": 403, "AACCC_": 404, "ATAAA_": 405, "ATAAT_": 406, "ATAAG_": 407, "ATAAC_": 408, "ATATA_": 409, "ATATT_": 410, "ATATG_": 411, "ATATC_": 412, "ATAGA_": 413, "ATAGT_": 414, "ATAGG_": 415, "ATAGC_": 416, "ATACA_": 417, "ATACT_": 418, "ATACG_": 419, "ATACC_": 420, "ATTAA_": 421, "ATTAT_": 422, "ATTAG_": 423, "ATTAC_": 424, "ATTTA_": 425, "ATTTT_": 426, "ATTTG_": 427, "ATTTC_": 428, "ATTGA_": 429, "ATTGT_": 430, "ATTGG_": 431, "ATTGC_": 432, "ATTCA_": 433, "ATTCT_": 434, "ATTCG_": 435, "ATTCC_": 436, "ATGAA_": 437, "ATGAT_": 438, "ATGAG_": 439, "ATGAC_": 440, "ATGTA_": 441, "ATGTT_": 442, "ATGTG_": 443, "ATGTC_": 444, "ATGGA_": 445, "ATGGT_": 446, "ATGGG_": 447, "ATGGC_": 448, "ATGCA_": 449, "ATGCT_": 450, "ATGCG_": 451, "ATGCC_": 452, "ATCAA_": 453, "ATCAT_": 454, "ATCAG_": 455, "ATCAC_": 456, "ATCTA_": 457, "ATCTT_": 458, "ATCTG_": 459, "ATCTC_": 460, "ATCGA_": 461, "ATCGT_": 462, "ATCGG_": 463, "ATCGC_": 464, "ATCCA_": 465, "ATCCT_": 466, "ATCCG_": 467, "ATCCC_": 468, "AGAAA_": 469, "AGAAT_": 470, "AGAAG_": 471, "AGAAC_": 472, "AGATA_": 473, "AGATT_": 474, "AGATG_": 475, "AGATC_": 476, "AGAGA_": 477, "AGAGT_": 478, "AGAGG_": 479, "AGAGC_": 480, "AGACA_": 481, "AGACT_": 482, "AGACG_": 483, "AGACC_": 484, "AGTAA_": 485, "AGTAT_": 486, "AGTAG_": 487, "AGTAC_": 488, "AGTTA_": 489, "AGTTT_": 490, "AGTTG_": 491, "AGTTC_": 492, "AGTGA_": 493, "AGTGT_": 494, "AGTGG_": 495, "AGTGC_": 496, "AGTCA_": 497, "AGTCT_": 498, "AGTCG_": 499, "AGTCC_": 500, "AGGAA_": 501, "AGGAT_": 502, "AGGAG_": 503, "AGGAC_": 504, "AGGTA_": 505, "AGGTT_": 506, "AGGTG_": 507, "AGGTC_": 508, "AGGGA_": 509, "AGGGT_": 510, "AGGGG_": 511, "AGGGC_": 512, "AGGCA_": 513, "AGGCT_": 514, "AGGCG_": 515, "AGGCC_": 516, "AGCAA_": 517, "AGCAT_": 518, "AGCAG_": 519, "AGCAC_": 520, "AGCTA_": 521, "AGCTT_": 522, "AGCTG_": 523, "AGCTC_": 524, "AGCGA_": 525, "AGCGT_": 526, "AGCGG_": 527, "AGCGC_": 528, "AGCCA_": 529, "AGCCT_": 530, "AGCCG_": 531, "AGCCC_": 532, "ACAAA_": 533, "ACAAT_": 534, "ACAAG_": 535, "ACAAC_": 536, "ACATA_": 537, "ACATT_": 538, "ACATG_": 539, "ACATC_": 540, "ACAGA_": 541, "ACAGT_": 542, "ACAGG_": 543, "ACAGC_": 544, "ACACA_": 545, "ACACT_": 546, "ACACG_": 547, "ACACC_": 548, "ACTAA_": 549, "ACTAT_": 550, "ACTAG_": 551, "ACTAC_": 552, "ACTTA_": 553, "ACTTT_": 554, "ACTTG_": 555, "ACTTC_": 556, "ACTGA_": 557, "ACTGT_": 558, "ACTGG_": 559, "ACTGC_": 560, "ACTCA_": 561, "ACTCT_": 562, "ACTCG_": 563, "ACTCC_": 564, "ACGAA_": 565, "ACGAT_": 566, "ACGAG_": 567, "ACGAC_": 568, "ACGTA_": 569, "ACGTT_": 570, "ACGTG_": 571, "ACGTC_": 572, "ACGGA_": 573, "ACGGT_": 574, "ACGGG_": 575, "ACGGC_": 576, "ACGCA_": 577, "ACGCT_": 578, "ACGCG_": 579, "ACGCC_": 580, "ACCAA_": 581, "ACCAT_": 582, "ACCAG_": 583, "ACCAC_": 584, "ACCTA_": 585, "ACCTT_": 586, "ACCTG_": 587, "ACCTC_": 588, "ACCGA_": 589, "ACCGT_": 590, "ACCGG_": 591, "ACCGC_": 592, "ACCCA_": 593, "ACCCT_": 594, "ACCCG_": 595, "ACCCC_": 596, "TAAAA_": 597, "TAAAT_": 598, "TAAAG_": 599, "TAAAC_": 600, "TAATA_": 601, "TAATT_": 602, "TAATG_": 603, "TAATC_": 604, "TAAGA_": 605, "TAAGT_": 606, "TAAGG_": 607, "TAAGC_": 608, "TAACA_": 609, "TAACT_": 610, "TAACG_": 611, "TAACC_": 612, "TATAA_": 613, "TATAT_": 614, "TATAG_": 615, "TATAC_": 616, "TATTA_": 617, "TATTT_": 618, "TATTG_": 619, "TATTC_": 620, "TATGA_": 621, "TATGT_": 622, "TATGG_": 623, "TATGC_": 624, "TATCA_": 625, "TATCT_": 626, "TATCG_": 627, "TATCC_": 628, "TAGAA_": 629, "TAGAT_": 630, "TAGAG_": 631, "TAGAC_": 632, "TAGTA_": 633, "TAGTT_": 634, "TAGTG_": 635, "TAGTC_": 636, "TAGGA_": 637, "TAGGT_": 638, "TAGGG_": 639, "TAGGC_": 640, "TAGCA_": 641, "TAGCT_": 642, "TAGCG_": 643, "TAGCC_": 644, "TACAA_": 645, "TACAT_": 646, "TACAG_": 647, "TACAC_": 648, "TACTA_": 649, "TACTT_": 650, "TACTG_": 651, "TACTC_": 652, "TACGA_": 653, "TACGT_": 654, "TACGG_": 655, "TACGC_": 656, "TACCA_": 657, "TACCT_": 658, "TACCG_": 659, "TACCC_": 660, "TTAAA_": 661, "TTAAT_": 662, "TTAAG_": 663, "TTAAC_": 664, "TTATA_": 665, "TTATT_": 666, "TTATG_": 667, "TTATC_": 668, "TTAGA_": 669, "TTAGT_": 670, "TTAGG_": 671, "TTAGC_": 672, "TTACA_": 673, "TTACT_": 674, "TTACG_": 675, "TTACC_": 676, "TTTAA_": 677, "TTTAT_": 678, "TTTAG_": 679, "TTTAC_": 680, "TTTTA_": 681, "TTTTT_": 682, "TTTTG_": 683, "TTTTC_": 684, "TTTGA_": 685, "TTTGT_": 686, "TTTGG_": 687, "TTTGC_": 688, "TTTCA_": 689, "TTTCT_": 690, "TTTCG_": 691, "TTTCC_": 692, "TTGAA_": 693, "TTGAT_": 694, "TTGAG_": 695, "TTGAC_": 696, "TTGTA_": 697, "TTGTT_": 698, "TTGTG_": 699, "TTGTC_": 700, "TTGGA_": 701, "TTGGT_": 702, "TTGGG_": 703, "TTGGC_": 704, "TTGCA_": 705, "TTGCT_": 706, "TTGCG_": 707, "TTGCC_": 708, "TTCAA_": 709, "TTCAT_": 710, "TTCAG_": 711, "TTCAC_": 712, "TTCTA_": 713, "TTCTT_": 714, "TTCTG_": 715, "TTCTC_": 716, "TTCGA_": 717, "TTCGT_": 718, "TTCGG_": 719, "TTCGC_": 720, "TTCCA_": 721, "TTCCT_": 722, "TTCCG_": 723, "TTCCC_": 724, "TGAAA_": 725, "TGAAT_": 726, "TGAAG_": 727, "TGAAC_": 728, "TGATA_": 729, "TGATT_": 730, "TGATG_": 731, "TGATC_": 732, "TGAGA_": 733, "TGAGT_": 734, "TGAGG_": 735, "TGAGC_": 736, "TGACA_": 737, "TGACT_": 738, "TGACG_": 739, "TGACC_": 740, "TGTAA_": 741, "TGTAT_": 742, "TGTAG_": 743, "TGTAC_": 744, "TGTTA_": 745, "TGTTT_": 746, "TGTTG_": 747, "TGTTC_": 748, "TGTGA_": 749, "TGTGT_": 750, "TGTGG_": 751, "TGTGC_": 752, "TGTCA_": 753, "TGTCT_": 754, "TGTCG_": 755, "TGTCC_": 756, "TGGAA_": 757, "TGGAT_": 758, "TGGAG_": 759, "TGGAC_": 760, "TGGTA_": 761, "TGGTT_": 762, "TGGTG_": 763, "TGGTC_": 764, "TGGGA_": 765, "TGGGT_": 766, "TGGGG_": 767, "TGGGC_": 768, "TGGCA_": 769, "TGGCT_": 770, "TGGCG_": 771, "TGGCC_": 772, "TGCAA_": 773, "TGCAT_": 774, "TGCAG_": 775, "TGCAC_": 776, "TGCTA_": 777, "TGCTT_": 778, "TGCTG_": 779, "TGCTC_": 780, "TGCGA_": 781, "TGCGT_": 782, "TGCGG_": 783, "TGCGC_": 784, "TGCCA_": 785, "TGCCT_": 786, "TGCCG_": 787, "TGCCC_": 788, "TCAAA_": 789, "TCAAT_": 790, "TCAAG_": 791, "TCAAC_": 792, "TCATA_": 793, "TCATT_": 794, "TCATG_": 795, "TCATC_": 796, "TCAGA_": 797, "TCAGT_": 798, "TCAGG_": 799, "TCAGC_": 800, "TCACA_": 801, "TCACT_": 802, "TCACG_": 803, "TCACC_": 804, "TCTAA_": 805, "TCTAT_": 806, "TCTAG_": 807, "TCTAC_": 808, "TCTTA_": 809, "TCTTT_": 810, "TCTTG_": 811, "TCTTC_": 812, "TCTGA_": 813, "TCTGT_": 814, "TCTGG_": 815, "TCTGC_": 816, "TCTCA_": 817, "TCTCT_": 818, "TCTCG_": 819, "TCTCC_": 820, "TCGAA_": 821, "TCGAT_": 822, "TCGAG_": 823, "TCGAC_": 824, "TCGTA_": 825, "TCGTT_": 826, "TCGTG_": 827, "TCGTC_": 828, "TCGGA_": 829, "TCGGT_": 830, "TCGGG_": 831, "TCGGC_": 832, "TCGCA_": 833, "TCGCT_": 834, "TCGCG_": 835, "TCGCC_": 836, "TCCAA_": 837, "TCCAT_": 838, "TCCAG_": 839, "TCCAC_": 840, "TCCTA_": 841, "TCCTT_": 842, "TCCTG_": 843, "TCCTC_": 844, "TCCGA_": 845, "TCCGT_": 846, "TCCGG_": 847, "TCCGC_": 848, "TCCCA_": 849, "TCCCT_": 850, "TCCCG_": 851, "TCCCC_": 852, "GAAAA_": 853, "GAAAT_": 854, "GAAAG_": 855, "GAAAC_": 856, "GAATA_": 857, "GAATT_": 858, "GAATG_": 859, "GAATC_": 860, "GAAGA_": 861, "GAAGT_": 862, "GAAGG_": 863, "GAAGC_": 864, "GAACA_": 865, "GAACT_": 866, "GAACG_": 867, "GAACC_": 868, "GATAA_": 869, "GATAT_": 870, "GATAG_": 871, "GATAC_": 872, "GATTA_": 873, "GATTT_": 874, "GATTG_": 875, "GATTC_": 876, "GATGA_": 877, "GATGT_": 878, "GATGG_": 879, "GATGC_": 880, "GATCA_": 881, "GATCT_": 882, "GATCG_": 883, "GATCC_": 884, "GAGAA_": 885, "GAGAT_": 886, "GAGAG_": 887, "GAGAC_": 888, "GAGTA_": 889, "GAGTT_": 890, "GAGTG_": 891, "GAGTC_": 892, "GAGGA_": 893, "GAGGT_": 894, "GAGGG_": 895, "GAGGC_": 896, "GAGCA_": 897, "GAGCT_": 898, "GAGCG_": 899, "GAGCC_": 900, "GACAA_": 901, "GACAT_": 902, "GACAG_": 903, "GACAC_": 904, "GACTA_": 905, "GACTT_": 906, "GACTG_": 907, "GACTC_": 908, "GACGA_": 909, "GACGT_": 910, "GACGG_": 911, "GACGC_": 912, "GACCA_": 913, "GACCT_": 914, "GACCG_": 915, "GACCC_": 916, "GTAAA_": 917, "GTAAT_": 918, "GTAAG_": 919, "GTAAC_": 920, "GTATA_": 921, "GTATT_": 922, "GTATG_": 923, "GTATC_": 924, "GTAGA_": 925, "GTAGT_": 926, "GTAGG_": 927, "GTAGC_": 928, "GTACA_": 929, "GTACT_": 930, "GTACG_": 931, "GTACC_": 932, "GTTAA_": 933, "GTTAT_": 934, "GTTAG_": 935, "GTTAC_": 936, "GTTTA_": 937, "GTTTT_": 938, "GTTTG_": 939, "GTTTC_": 940, "GTTGA_": 941, "GTTGT_": 942, "GTTGG_": 943, "GTTGC_": 944, "GTTCA_": 945, "GTTCT_": 946, "GTTCG_": 947, "GTTCC_": 948, "GTGAA_": 949, "GTGAT_": 950, "GTGAG_": 951, "GTGAC_": 952, "GTGTA_": 953, "GTGTT_": 954, "GTGTG_": 955, "GTGTC_": 956, "GTGGA_": 957, "GTGGT_": 958, "GTGGG_": 959, "GTGGC_": 960, "GTGCA_": 961, "GTGCT_": 962, "GTGCG_": 963, "GTGCC_": 964, "GTCAA_": 965, "GTCAT_": 966, "GTCAG_": 967, "GTCAC_": 968, "GTCTA_": 969, "GTCTT_": 970, "GTCTG_": 971, "GTCTC_": 972, "GTCGA_": 973, "GTCGT_": 974, "GTCGG_": 975, "GTCGC_": 976, "GTCCA_": 977, "GTCCT_": 978, "GTCCG_": 979, "GTCCC_": 980, "GGAAA_": 981, "GGAAT_": 982, "GGAAG_": 983, "GGAAC_": 984, "GGATA_": 985, "GGATT_": 986, "GGATG_": 987, "GGATC_": 988, "GGAGA_": 989, "GGAGT_": 990, "GGAGG_": 991, "GGAGC_": 992, "GGACA_": 993, "GGACT_": 994, "GGACG_": 995, "GGACC_": 996, "GGTAA_": 997, "GGTAT_": 998, "GGTAG_": 999, "GGTAC_": 1000, "GGTTA_": 1001, "GGTTT_": 1002, "GGTTG_": 1003, "GGTTC_": 1004, "GGTGA_": 1005, "GGTGT_": 1006, "GGTGG_": 1007, "GGTGC_": 1008, "GGTCA_": 1009, "GGTCT_": 1010, "GGTCG_": 1011, "GGTCC_": 1012, "GGGAA_": 1013, "GGGAT_": 1014, "GGGAG_": 1015, "GGGAC_": 1016, "GGGTA_": 1017, "GGGTT_": 1018, "GGGTG_": 1019, "GGGTC_": 1020, "GGGGA_": 1021, "GGGGT_": 1022, "GGGGG_": 1023, "GGGGC_": 1024, "GGGCA_": 1025, "GGGCT_": 1026, "GGGCG_": 1027, "GGGCC_": 1028, "GGCAA_": 1029, "GGCAT_": 1030, "GGCAG_": 1031, "GGCAC_": 1032, "GGCTA_": 1033, "GGCTT_": 1034, "GGCTG_": 1035, "GGCTC_": 1036, "GGCGA_": 1037, "GGCGT_": 1038, "GGCGG_": 1039, "GGCGC_": 1040, "GGCCA_": 1041, "GGCCT_": 1042, "GGCCG_": 1043, "GGCCC_": 1044, "GCAAA_": 1045, "GCAAT_": 1046, "GCAAG_": 1047, "GCAAC_": 1048, "GCATA_": 1049, "GCATT_": 1050, "GCATG_": 1051, "GCATC_": 1052, "GCAGA_": 1053, "GCAGT_": 1054, "GCAGG_": 1055, "GCAGC_": 1056, "GCACA_": 1057, "GCACT_": 1058, "GCACG_": 1059, "GCACC_": 1060, "GCTAA_": 1061, "GCTAT_": 1062, "GCTAG_": 1063, "GCTAC_": 1064, "GCTTA_": 1065, "GCTTT_": 1066, "GCTTG_": 1067, "GCTTC_": 1068, "GCTGA_": 1069, "GCTGT_": 1070, "GCTGG_": 1071, "GCTGC_": 1072, "GCTCA_": 1073, "GCTCT_": 1074, "GCTCG_": 1075, "GCTCC_": 1076, "GCGAA_": 1077, "GCGAT_": 1078, "GCGAG_": 1079, "GCGAC_": 1080, "GCGTA_": 1081, "GCGTT_": 1082, "GCGTG_": 1083, "GCGTC_": 1084, "GCGGA_": 1085, "GCGGT_": 1086, "GCGGG_": 1087, "GCGGC_": 1088, "GCGCA_": 1089, "GCGCT_": 1090, "GCGCG_": 1091, "GCGCC_": 1092, "GCCAA_": 1093, "GCCAT_": 1094, "GCCAG_": 1095, "GCCAC_": 1096, "GCCTA_": 1097, "GCCTT_": 1098, "GCCTG_": 1099, "GCCTC_": 1100, "GCCGA_": 1101, "GCCGT_": 1102, "GCCGG_": 1103, "GCCGC_": 1104, "GCCCA_": 1105, "GCCCT_": 1106, "GCCCG_": 1107, "GCCCC_": 1108, "CAAAA_": 1109, "CAAAT_": 1110, "CAAAG_": 1111, "CAAAC_": 1112, "CAATA_": 1113, "CAATT_": 1114, "CAATG_": 1115, "CAATC_": 1116, "CAAGA_": 1117, "CAAGT_": 1118, "CAAGG_": 1119, "CAAGC_": 1120, "CAACA_": 1121, "CAACT_": 1122, "CAACG_": 1123, "CAACC_": 1124, "CATAA_": 1125, "CATAT_": 1126, "CATAG_": 1127, "CATAC_": 1128, "CATTA_": 1129, "CATTT_": 1130, "CATTG_": 1131, "CATTC_": 1132, "CATGA_": 1133, "CATGT_": 1134, "CATGG_": 1135, "CATGC_": 1136, "CATCA_": 1137, "CATCT_": 1138, "CATCG_": 1139, "CATCC_": 1140, "CAGAA_": 1141, "CAGAT_": 1142, "CAGAG_": 1143, "CAGAC_": 1144, "CAGTA_": 1145, "CAGTT_": 1146, "CAGTG_": 1147, "CAGTC_": 1148, "CAGGA_": 1149, "CAGGT_": 1150, "CAGGG_": 1151, "CAGGC_": 1152, "CAGCA_": 1153, "CAGCT_": 1154, "CAGCG_": 1155, "CAGCC_": 1156, "CACAA_": 1157, "CACAT_": 1158, "CACAG_": 1159, "CACAC_": 1160, "CACTA_": 1161, "CACTT_": 1162, "CACTG_": 1163, "CACTC_": 1164, "CACGA_": 1165, "CACGT_": 1166, "CACGG_": 1167, "CACGC_": 1168, "CACCA_": 1169, "CACCT_": 1170, "CACCG_": 1171, "CACCC_": 1172, "CTAAA_": 1173, "CTAAT_": 1174, "CTAAG_": 1175, "CTAAC_": 1176, "CTATA_": 1177, "CTATT_": 1178, "CTATG_": 1179, "CTATC_": 1180, "CTAGA_": 1181, "CTAGT_": 1182, "CTAGG_": 1183, "CTAGC_": 1184, "CTACA_": 1185, "CTACT_": 1186, "CTACG_": 1187, "CTACC_": 1188, "CTTAA_": 1189, "CTTAT_": 1190, "CTTAG_": 1191, "CTTAC_": 1192, "CTTTA_": 1193, "CTTTT_": 1194, "CTTTG_": 1195, "CTTTC_": 1196, "CTTGA_": 1197, "CTTGT_": 1198, "CTTGG_": 1199, "CTTGC_": 1200, "CTTCA_": 1201, "CTTCT_": 1202, "CTTCG_": 1203, "CTTCC_": 1204, "CTGAA_": 1205, "CTGAT_": 1206, "CTGAG_": 1207, "CTGAC_": 1208, "CTGTA_": 1209, "CTGTT_": 1210, "CTGTG_": 1211, "CTGTC_": 1212, "CTGGA_": 1213, "CTGGT_": 1214, "CTGGG_": 1215, "CTGGC_": 1216, "CTGCA_": 1217, "CTGCT_": 1218, "CTGCG_": 1219, "CTGCC_": 1220, "CTCAA_": 1221, "CTCAT_": 1222, "CTCAG_": 1223, "CTCAC_": 1224, "CTCTA_": 1225, "CTCTT_": 1226, "CTCTG_": 1227, "CTCTC_": 1228, "CTCGA_": 1229, "CTCGT_": 1230, "CTCGG_": 1231, "CTCGC_": 1232, "CTCCA_": 1233, "CTCCT_": 1234, "CTCCG_": 1235, "CTCCC_": 1236, "CGAAA_": 1237, "CGAAT_": 1238, "CGAAG_": 1239, "CGAAC_": 1240, "CGATA_": 1241, "CGATT_": 1242, "CGATG_": 1243, "CGATC_": 1244, "CGAGA_": 1245, "CGAGT_": 1246, "CGAGG_": 1247, "CGAGC_": 1248, "CGACA_": 1249, "CGACT_": 1250, "CGACG_": 1251, "CGACC_": 1252, "CGTAA_": 1253, "CGTAT_": 1254, "CGTAG_": 1255, "CGTAC_": 1256, "CGTTA_": 1257, "CGTTT_": 1258, "CGTTG_": 1259, "CGTTC_": 1260, "CGTGA_": 1261, "CGTGT_": 1262, "CGTGG_": 1263, "CGTGC_": 1264, "CGTCA_": 1265, "CGTCT_": 1266, "CGTCG_": 1267, "CGTCC_": 1268, "CGGAA_": 1269, "CGGAT_": 1270, "CGGAG_": 1271, "CGGAC_": 1272, "CGGTA_": 1273, "CGGTT_": 1274, "CGGTG_": 1275, "CGGTC_": 1276, "CGGGA_": 1277, "CGGGT_": 1278, "CGGGG_": 1279, "CGGGC_": 1280, "CGGCA_": 1281, "CGGCT_": 1282, "CGGCG_": 1283, "CGGCC_": 1284, "CGCAA_": 1285, "CGCAT_": 1286, "CGCAG_": 1287, "CGCAC_": 1288, "CGCTA_": 1289, "CGCTT_": 1290, "CGCTG_": 1291, "CGCTC_": 1292, "CGCGA_": 1293, "CGCGT_": 1294, "CGCGG_": 1295, "CGCGC_": 1296, "CGCCA_": 1297, "CGCCT_": 1298, "CGCCG_": 1299, "CGCCC_": 1300, "CCAAA_": 1301, "CCAAT_": 1302, "CCAAG_": 1303, "CCAAC_": 1304, "CCATA_": 1305, "CCATT_": 1306, "CCATG_": 1307, "CCATC_": 1308, "CCAGA_": 1309, "CCAGT_": 1310, "CCAGG_": 1311, "CCAGC_": 1312, "CCACA_": 1313, "CCACT_": 1314, "CCACG_": 1315, "CCACC_": 1316, "CCTAA_": 1317, "CCTAT_": 1318, "CCTAG_": 1319, "CCTAC_": 1320, "CCTTA_": 1321, "CCTTT_": 1322, "CCTTG_": 1323, "CCTTC_": 1324, "CCTGA_": 1325, "CCTGT_": 1326, "CCTGG_": 1327, "CCTGC_": 1328, "CCTCA_": 1329, "CCTCT_": 1330, "CCTCG_": 1331, "CCTCC_": 1332, "CCGAA_": 1333, "CCGAT_": 1334, "CCGAG_": 1335, "CCGAC_": 1336, "CCGTA_": 1337, "CCGTT_": 1338, "CCGTG_": 1339, "CCGTC_": 1340, "CCGGA_": 1341, "CCGGT_": 1342, "CCGGG_": 1343, "CCGGC_": 1344, "CCGCA_": 1345, "CCGCT_": 1346, "CCGCG_": 1347, "CCGCC_": 1348, "CCCAA_": 1349, "CCCAT_": 1350, "CCCAG_": 1351, "CCCAC_": 1352, "CCCTA_": 1353, "CCCTT_": 1354, "CCCTG_": 1355, "CCCTC_": 1356, "CCCGA_": 1357, "CCCGT_": 1358, "CCCGG_": 1359, "CCCGC_": 1360, "CCCCA_": 1361, "CCCCT_": 1362, "CCCCG_": 1363, "CCCCC_": 1364, "AAAAAA": 1365, "AAAAAT": 1366, "AAAAAG": 1367, "AAAAAC": 1368, "AAAATA": 1369, "AAAATT": 1370, "AAAATG": 1371, "AAAATC": 1372, "AAAAGA": 1373, "AAAAGT": 1374, "AAAAGG": 1375, "AAAAGC": 1376, "AAAACA": 1377, "AAAACT": 1378, "AAAACG": 1379, "AAAACC": 1380, "AAATAA": 1381, "AAATAT": 1382, "AAATAG": 1383, "AAATAC": 1384, "AAATTA": 1385, "AAATTT": 1386, "AAATTG": 1387, "AAATTC": 1388, "AAATGA": 1389, "AAATGT": 1390, "AAATGG": 1391, "AAATGC": 1392, "AAATCA": 1393, "AAATCT": 1394, "AAATCG": 1395, "AAATCC": 1396, "AAAGAA": 1397, "AAAGAT": 1398, "AAAGAG": 1399, "AAAGAC": 1400, "AAAGTA": 1401, "AAAGTT": 1402, "AAAGTG": 1403, "AAAGTC": 1404, "AAAGGA": 1405, "AAAGGT": 1406, "AAAGGG": 1407, "AAAGGC": 1408, "AAAGCA": 1409, "AAAGCT": 1410, "AAAGCG": 1411, "AAAGCC": 1412, "AAACAA": 1413, "AAACAT": 1414, "AAACAG": 1415, "AAACAC": 1416, "AAACTA": 1417, "AAACTT": 1418, "AAACTG": 1419, "AAACTC": 1420, "AAACGA": 1421, "AAACGT": 1422, "AAACGG": 1423, "AAACGC": 1424, "AAACCA": 1425, "AAACCT": 1426, "AAACCG": 1427, "AAACCC": 1428, "AATAAA": 1429, "AATAAT": 1430, "AATAAG": 1431, "AATAAC": 1432, "AATATA": 1433, "AATATT": 1434, "AATATG": 1435, "AATATC": 1436, "AATAGA": 1437, "AATAGT": 1438, "AATAGG": 1439, "AATAGC": 1440, "AATACA": 1441, "AATACT": 1442, "AATACG": 1443, "AATACC": 1444, "AATTAA": 1445, "AATTAT": 1446, "AATTAG": 1447, "AATTAC": 1448, "AATTTA": 1449, "AATTTT": 1450, "AATTTG": 1451, "AATTTC": 1452, "AATTGA": 1453, "AATTGT": 1454, "AATTGG": 1455, "AATTGC": 1456, "AATTCA": 1457, "AATTCT": 1458, "AATTCG": 1459, "AATTCC": 1460, "AATGAA": 1461, "AATGAT": 1462, "AATGAG": 1463, "AATGAC": 1464, "AATGTA": 1465, "AATGTT": 1466, "AATGTG": 1467, "AATGTC": 1468, "AATGGA": 1469, "AATGGT": 1470, "AATGGG": 1471, "AATGGC": 1472, "AATGCA": 1473, "AATGCT": 1474, "AATGCG": 1475, "AATGCC": 1476, "AATCAA": 1477, "AATCAT": 1478, "AATCAG": 1479, "AATCAC": 1480, "AATCTA": 1481, "AATCTT": 1482, "AATCTG": 1483, "AATCTC": 1484, "AATCGA": 1485, "AATCGT": 1486, "AATCGG": 1487, "AATCGC": 1488, "AATCCA": 1489, "AATCCT": 1490, "AATCCG": 1491, "AATCCC": 1492, "AAGAAA": 1493, "AAGAAT": 1494, "AAGAAG": 1495, "AAGAAC": 1496, "AAGATA": 1497, "AAGATT": 1498, "AAGATG": 1499, "AAGATC": 1500, "AAGAGA": 1501, "AAGAGT": 1502, "AAGAGG": 1503, "AAGAGC": 1504, "AAGACA": 1505, "AAGACT": 1506, "AAGACG": 1507, "AAGACC": 1508, "AAGTAA": 1509, "AAGTAT": 1510, "AAGTAG": 1511, "AAGTAC": 1512, "AAGTTA": 1513, "AAGTTT": 1514, "AAGTTG": 1515, "AAGTTC": 1516, "AAGTGA": 1517, "AAGTGT": 1518, "AAGTGG": 1519, "AAGTGC": 1520, "AAGTCA": 1521, "AAGTCT": 1522, "AAGTCG": 1523, "AAGTCC": 1524, "AAGGAA": 1525, "AAGGAT": 1526, "AAGGAG": 1527, "AAGGAC": 1528, "AAGGTA": 1529, "AAGGTT": 1530, "AAGGTG": 1531, "AAGGTC": 1532, "AAGGGA": 1533, "AAGGGT": 1534, "AAGGGG": 1535, "AAGGGC": 1536, "AAGGCA": 1537, "AAGGCT": 1538, "AAGGCG": 1539, "AAGGCC": 1540, "AAGCAA": 1541, "AAGCAT": 1542, "AAGCAG": 1543, "AAGCAC": 1544, "AAGCTA": 1545, "AAGCTT": 1546, "AAGCTG": 1547, "AAGCTC": 1548, "AAGCGA": 1549, "AAGCGT": 1550, "AAGCGG": 1551, "AAGCGC": 1552, "AAGCCA": 1553, "AAGCCT": 1554, "AAGCCG": 1555, "AAGCCC": 1556, "AACAAA": 1557, "AACAAT": 1558, "AACAAG": 1559, "AACAAC": 1560, "AACATA": 1561, "AACATT": 1562, "AACATG": 1563, "AACATC": 1564, "AACAGA": 1565, "AACAGT": 1566, "AACAGG": 1567, "AACAGC": 1568, "AACACA": 1569, "AACACT": 1570, "AACACG": 1571, "AACACC": 1572, "AACTAA": 1573, "AACTAT": 1574, "AACTAG": 1575, "AACTAC": 1576, "AACTTA": 1577, "AACTTT": 1578, "AACTTG": 1579, "AACTTC": 1580, "AACTGA": 1581, "AACTGT": 1582, "AACTGG": 1583, "AACTGC": 1584, "AACTCA": 1585, "AACTCT": 1586, "AACTCG": 1587, "AACTCC": 1588, "AACGAA": 1589, "AACGAT": 1590, "AACGAG": 1591, "AACGAC": 1592, "AACGTA": 1593, "AACGTT": 1594, "AACGTG": 1595, "AACGTC": 1596, "AACGGA": 1597, "AACGGT": 1598, "AACGGG": 1599, "AACGGC": 1600, "AACGCA": 1601, "AACGCT": 1602, "AACGCG": 1603, "AACGCC": 1604, "AACCAA": 1605, "AACCAT": 1606, "AACCAG": 1607, "AACCAC": 1608, "AACCTA": 1609, "AACCTT": 1610, "AACCTG": 1611, "AACCTC": 1612, "AACCGA": 1613, "AACCGT": 1614, "AACCGG": 1615, "AACCGC": 1616, "AACCCA": 1617, "AACCCT": 1618, "AACCCG": 1619, "AACCCC": 1620, "ATAAAA": 1621, "ATAAAT": 1622, "ATAAAG": 1623, "ATAAAC": 1624, "ATAATA": 1625, "ATAATT": 1626, "ATAATG": 1627, "ATAATC": 1628, "ATAAGA": 1629, "ATAAGT": 1630, "ATAAGG": 1631, "ATAAGC": 1632, "ATAACA": 1633, "ATAACT": 1634, "ATAACG": 1635, "ATAACC": 1636, "ATATAA": 1637, "ATATAT": 1638, "ATATAG": 1639, "ATATAC": 1640, "ATATTA": 1641, "ATATTT": 1642, "ATATTG": 1643, "ATATTC": 1644, "ATATGA": 1645, "ATATGT": 1646, "ATATGG": 1647, "ATATGC": 1648, "ATATCA": 1649, "ATATCT": 1650, "ATATCG": 1651, "ATATCC": 1652, "ATAGAA": 1653, "ATAGAT": 1654, "ATAGAG": 1655, "ATAGAC": 1656, "ATAGTA": 1657, "ATAGTT": 1658, "ATAGTG": 1659, "ATAGTC": 1660, "ATAGGA": 1661, "ATAGGT": 1662, "ATAGGG": 1663, "ATAGGC": 1664, "ATAGCA": 1665, "ATAGCT": 1666, "ATAGCG": 1667, "ATAGCC": 1668, "ATACAA": 1669, "ATACAT": 1670, "ATACAG": 1671, "ATACAC": 1672, "ATACTA": 1673, "ATACTT": 1674, "ATACTG": 1675, "ATACTC": 1676, "ATACGA": 1677, "ATACGT": 1678, "ATACGG": 1679, "ATACGC": 1680, "ATACCA": 1681, "ATACCT": 1682, "ATACCG": 1683, "ATACCC": 1684, "ATTAAA": 1685, "ATTAAT": 1686, "ATTAAG": 1687, "ATTAAC": 1688, "ATTATA": 1689, "ATTATT": 1690, "ATTATG": 1691, "ATTATC": 1692, "ATTAGA": 1693, "ATTAGT": 1694, "ATTAGG": 1695, "ATTAGC": 1696, "ATTACA": 1697, "ATTACT": 1698, "ATTACG": 1699, "ATTACC": 1700, "ATTTAA": 1701, "ATTTAT": 1702, "ATTTAG": 1703, "ATTTAC": 1704, "ATTTTA": 1705, "ATTTTT": 1706, "ATTTTG": 1707, "ATTTTC": 1708, "ATTTGA": 1709, "ATTTGT": 1710, "ATTTGG": 1711, "ATTTGC": 1712, "ATTTCA": 1713, "ATTTCT": 1714, "ATTTCG": 1715, "ATTTCC": 1716, "ATTGAA": 1717, "ATTGAT": 1718, "ATTGAG": 1719, "ATTGAC": 1720, "ATTGTA": 1721, "ATTGTT": 1722, "ATTGTG": 1723, "ATTGTC": 1724, "ATTGGA": 1725, "ATTGGT": 1726, "ATTGGG": 1727, "ATTGGC": 1728, "ATTGCA": 1729, "ATTGCT": 1730, "ATTGCG": 1731, "ATTGCC": 1732, "ATTCAA": 1733, "ATTCAT": 1734, "ATTCAG": 1735, "ATTCAC": 1736, "ATTCTA": 1737, "ATTCTT": 1738, "ATTCTG": 1739, "ATTCTC": 1740, "ATTCGA": 1741, "ATTCGT": 1742, "ATTCGG": 1743, "ATTCGC": 1744, "ATTCCA": 1745, "ATTCCT": 1746, "ATTCCG": 1747, "ATTCCC": 1748, "ATGAAA": 1749, "ATGAAT": 1750, "ATGAAG": 1751, "ATGAAC": 1752, "ATGATA": 1753, "ATGATT": 1754, "ATGATG": 1755, "ATGATC": 1756, "ATGAGA": 1757, "ATGAGT": 1758, "ATGAGG": 1759, "ATGAGC": 1760, "ATGACA": 1761, "ATGACT": 1762, "ATGACG": 1763, "ATGACC": 1764, "ATGTAA": 1765, "ATGTAT": 1766, "ATGTAG": 1767, "ATGTAC": 1768, "ATGTTA": 1769, "ATGTTT": 1770, "ATGTTG": 1771, "ATGTTC": 1772, "ATGTGA": 1773, "ATGTGT": 1774, "ATGTGG": 1775, "ATGTGC": 1776, "ATGTCA": 1777, "ATGTCT": 1778, "ATGTCG": 1779, "ATGTCC": 1780, "ATGGAA": 1781, "ATGGAT": 1782, "ATGGAG": 1783, "ATGGAC": 1784, "ATGGTA": 1785, "ATGGTT": 1786, "ATGGTG": 1787, "ATGGTC": 1788, "ATGGGA": 1789, "ATGGGT": 1790, "ATGGGG": 1791, "ATGGGC": 1792, "ATGGCA": 1793, "ATGGCT": 1794, "ATGGCG": 1795, "ATGGCC": 1796, "ATGCAA": 1797, "ATGCAT": 1798, "ATGCAG": 1799, "ATGCAC": 1800, "ATGCTA": 1801, "ATGCTT": 1802, "ATGCTG": 1803, "ATGCTC": 1804, "ATGCGA": 1805, "ATGCGT": 1806, "ATGCGG": 1807, "ATGCGC": 1808, "ATGCCA": 1809, "ATGCCT": 1810, "ATGCCG": 1811, "ATGCCC": 1812, "ATCAAA": 1813, "ATCAAT": 1814, "ATCAAG": 1815, "ATCAAC": 1816, "ATCATA": 1817, "ATCATT": 1818, "ATCATG": 1819, "ATCATC": 1820, "ATCAGA": 1821, "ATCAGT": 1822, "ATCAGG": 1823, "ATCAGC": 1824, "ATCACA": 1825, "ATCACT": 1826, "ATCACG": 1827, "ATCACC": 1828, "ATCTAA": 1829, "ATCTAT": 1830, "ATCTAG": 1831, "ATCTAC": 1832, "ATCTTA": 1833, "ATCTTT": 1834, "ATCTTG": 1835, "ATCTTC": 1836, "ATCTGA": 1837, "ATCTGT": 1838, "ATCTGG": 1839, "ATCTGC": 1840, "ATCTCA": 1841, "ATCTCT": 1842, "ATCTCG": 1843, "ATCTCC": 1844, "ATCGAA": 1845, "ATCGAT": 1846, "ATCGAG": 1847, "ATCGAC": 1848, "ATCGTA": 1849, "ATCGTT": 1850, "ATCGTG": 1851, "ATCGTC": 1852, "ATCGGA": 1853, "ATCGGT": 1854, "ATCGGG": 1855, "ATCGGC": 1856, "ATCGCA": 1857, "ATCGCT": 1858, "ATCGCG": 1859, "ATCGCC": 1860, "ATCCAA": 1861, "ATCCAT": 1862, "ATCCAG": 1863, "ATCCAC": 1864, "ATCCTA": 1865, "ATCCTT": 1866, "ATCCTG": 1867, "ATCCTC": 1868, "ATCCGA": 1869, "ATCCGT": 1870, "ATCCGG": 1871, "ATCCGC": 1872, "ATCCCA": 1873, "ATCCCT": 1874, "ATCCCG": 1875, "ATCCCC": 1876, "AGAAAA": 1877, "AGAAAT": 1878, "AGAAAG": 1879, "AGAAAC": 1880, "AGAATA": 1881, "AGAATT": 1882, "AGAATG": 1883, "AGAATC": 1884, "AGAAGA": 1885, "AGAAGT": 1886, "AGAAGG": 1887, "AGAAGC": 1888, "AGAACA": 1889, "AGAACT": 1890, "AGAACG": 1891, "AGAACC": 1892, "AGATAA": 1893, "AGATAT": 1894, "AGATAG": 1895, "AGATAC": 1896, "AGATTA": 1897, "AGATTT": 1898, "AGATTG": 1899, "AGATTC": 1900, "AGATGA": 1901, "AGATGT": 1902, "AGATGG": 1903, "AGATGC": 1904, "AGATCA": 1905, "AGATCT": 1906, "AGATCG": 1907, "AGATCC": 1908, "AGAGAA": 1909, "AGAGAT": 1910, "AGAGAG": 1911, "AGAGAC": 1912, "AGAGTA": 1913, "AGAGTT": 1914, "AGAGTG": 1915, "AGAGTC": 1916, "AGAGGA": 1917, "AGAGGT": 1918, "AGAGGG": 1919, "AGAGGC": 1920, "AGAGCA": 1921, "AGAGCT": 1922, "AGAGCG": 1923, "AGAGCC": 1924, "AGACAA": 1925, "AGACAT": 1926, "AGACAG": 1927, "AGACAC": 1928, "AGACTA": 1929, "AGACTT": 1930, "AGACTG": 1931, "AGACTC": 1932, "AGACGA": 1933, "AGACGT": 1934, "AGACGG": 1935, "AGACGC": 1936, "AGACCA": 1937, "AGACCT": 1938, "AGACCG": 1939, "AGACCC": 1940, "AGTAAA": 1941, "AGTAAT": 1942, "AGTAAG": 1943, "AGTAAC": 1944, "AGTATA": 1945, "AGTATT": 1946, "AGTATG": 1947, "AGTATC": 1948, "AGTAGA": 1949, "AGTAGT": 1950, "AGTAGG": 1951, "AGTAGC": 1952, "AGTACA": 1953, "AGTACT": 1954, "AGTACG": 1955, "AGTACC": 1956, "AGTTAA": 1957, "AGTTAT": 1958, "AGTTAG": 1959, "AGTTAC": 1960, "AGTTTA": 1961, "AGTTTT": 1962, "AGTTTG": 1963, "AGTTTC": 1964, "AGTTGA": 1965, "AGTTGT": 1966, "AGTTGG": 1967, "AGTTGC": 1968, "AGTTCA": 1969, "AGTTCT": 1970, "AGTTCG": 1971, "AGTTCC": 1972, "AGTGAA": 1973, "AGTGAT": 1974, "AGTGAG": 1975, "AGTGAC": 1976, "AGTGTA": 1977, "AGTGTT": 1978, "AGTGTG": 1979, "AGTGTC": 1980, "AGTGGA": 1981, "AGTGGT": 1982, "AGTGGG": 1983, "AGTGGC": 1984, "AGTGCA": 1985, "AGTGCT": 1986, "AGTGCG": 1987, "AGTGCC": 1988, "AGTCAA": 1989, "AGTCAT": 1990, "AGTCAG": 1991, "AGTCAC": 1992, "AGTCTA": 1993, "AGTCTT": 1994, "AGTCTG": 1995, "AGTCTC": 1996, "AGTCGA": 1997, "AGTCGT": 1998, "AGTCGG": 1999, "AGTCGC": 2000, "AGTCCA": 2001, "AGTCCT": 2002, "AGTCCG": 2003, "AGTCCC": 2004, "AGGAAA": 2005, "AGGAAT": 2006, "AGGAAG": 2007, "AGGAAC": 2008, "AGGATA": 2009, "AGGATT": 2010, "AGGATG": 2011, "AGGATC": 2012, "AGGAGA": 2013, "AGGAGT": 2014, "AGGAGG": 2015, "AGGAGC": 2016, "AGGACA": 2017, "AGGACT": 2018, "AGGACG": 2019, "AGGACC": 2020, "AGGTAA": 2021, "AGGTAT": 2022, "AGGTAG": 2023, "AGGTAC": 2024, "AGGTTA": 2025, "AGGTTT": 2026, "AGGTTG": 2027, "AGGTTC": 2028, "AGGTGA": 2029, "AGGTGT": 2030, "AGGTGG": 2031, "AGGTGC": 2032, "AGGTCA": 2033, "AGGTCT": 2034, "AGGTCG": 2035, "AGGTCC": 2036, "AGGGAA": 2037, "AGGGAT": 2038, "AGGGAG": 2039, "AGGGAC": 2040, "AGGGTA": 2041, "AGGGTT": 2042, "AGGGTG": 2043, "AGGGTC": 2044, "AGGGGA": 2045, "AGGGGT": 2046, "AGGGGG": 2047, "AGGGGC": 2048, "AGGGCA": 2049, "AGGGCT": 2050, "AGGGCG": 2051, "AGGGCC": 2052, "AGGCAA": 2053, "AGGCAT": 2054, "AGGCAG": 2055, "AGGCAC": 2056, "AGGCTA": 2057, "AGGCTT": 2058, "AGGCTG": 2059, "AGGCTC": 2060, "AGGCGA": 2061, "AGGCGT": 2062, "AGGCGG": 2063, "AGGCGC": 2064, "AGGCCA": 2065, "AGGCCT": 2066, "AGGCCG": 2067, "AGGCCC": 2068, "AGCAAA": 2069, "AGCAAT": 2070, "AGCAAG": 2071, "AGCAAC": 2072, "AGCATA": 2073, "AGCATT": 2074, "AGCATG": 2075, "AGCATC": 2076, "AGCAGA": 2077, "AGCAGT": 2078, "AGCAGG": 2079, "AGCAGC": 2080, "AGCACA": 2081, "AGCACT": 2082, "AGCACG": 2083, "AGCACC": 2084, "AGCTAA": 2085, "AGCTAT": 2086, "AGCTAG": 2087, "AGCTAC": 2088, "AGCTTA": 2089, "AGCTTT": 2090, "AGCTTG": 2091, "AGCTTC": 2092, "AGCTGA": 2093, "AGCTGT": 2094, "AGCTGG": 2095, "AGCTGC": 2096, "AGCTCA": 2097, "AGCTCT": 2098, "AGCTCG": 2099, "AGCTCC": 2100, "AGCGAA": 2101, "AGCGAT": 2102, "AGCGAG": 2103, "AGCGAC": 2104, "AGCGTA": 2105, "AGCGTT": 2106, "AGCGTG": 2107, "AGCGTC": 2108, "AGCGGA": 2109, "AGCGGT": 2110, "AGCGGG": 2111, "AGCGGC": 2112, "AGCGCA": 2113, "AGCGCT": 2114, "AGCGCG": 2115, "AGCGCC": 2116, "AGCCAA": 2117, "AGCCAT": 2118, "AGCCAG": 2119, "AGCCAC": 2120, "AGCCTA": 2121, "AGCCTT": 2122, "AGCCTG": 2123, "AGCCTC": 2124, "AGCCGA": 2125, "AGCCGT": 2126, "AGCCGG": 2127, "AGCCGC": 2128, "AGCCCA": 2129, "AGCCCT": 2130, "AGCCCG": 2131, "AGCCCC": 2132, "ACAAAA": 2133, "ACAAAT": 2134, "ACAAAG": 2135, "ACAAAC": 2136, "ACAATA": 2137, "ACAATT": 2138, "ACAATG": 2139, "ACAATC": 2140, "ACAAGA": 2141, "ACAAGT": 2142, "ACAAGG": 2143, "ACAAGC": 2144, "ACAACA": 2145, "ACAACT": 2146, "ACAACG": 2147, "ACAACC": 2148, "ACATAA": 2149, "ACATAT": 2150, "ACATAG": 2151, "ACATAC": 2152, "ACATTA": 2153, "ACATTT": 2154, "ACATTG": 2155, "ACATTC": 2156, "ACATGA": 2157, "ACATGT": 2158, "ACATGG": 2159, "ACATGC": 2160, "ACATCA": 2161, "ACATCT": 2162, "ACATCG": 2163, "ACATCC": 2164, "ACAGAA": 2165, "ACAGAT": 2166, "ACAGAG": 2167, "ACAGAC": 2168, "ACAGTA": 2169, "ACAGTT": 2170, "ACAGTG": 2171, "ACAGTC": 2172, "ACAGGA": 2173, "ACAGGT": 2174, "ACAGGG": 2175, "ACAGGC": 2176, "ACAGCA": 2177, "ACAGCT": 2178, "ACAGCG": 2179, "ACAGCC": 2180, "ACACAA": 2181, "ACACAT": 2182, "ACACAG": 2183, "ACACAC": 2184, "ACACTA": 2185, "ACACTT": 2186, "ACACTG": 2187, "ACACTC": 2188, "ACACGA": 2189, "ACACGT": 2190, "ACACGG": 2191, "ACACGC": 2192, "ACACCA": 2193, "ACACCT": 2194, "ACACCG": 2195, "ACACCC": 2196, "ACTAAA": 2197, "ACTAAT": 2198, "ACTAAG": 2199, "ACTAAC": 2200, "ACTATA": 2201, "ACTATT": 2202, "ACTATG": 2203, "ACTATC": 2204, "ACTAGA": 2205, "ACTAGT": 2206, "ACTAGG": 2207, "ACTAGC": 2208, "ACTACA": 2209, "ACTACT": 2210, "ACTACG": 2211, "ACTACC": 2212, "ACTTAA": 2213, "ACTTAT": 2214, "ACTTAG": 2215, "ACTTAC": 2216, "ACTTTA": 2217, "ACTTTT": 2218, "ACTTTG": 2219, "ACTTTC": 2220, "ACTTGA": 2221, "ACTTGT": 2222, "ACTTGG": 2223, "ACTTGC": 2224, "ACTTCA": 2225, "ACTTCT": 2226, "ACTTCG": 2227, "ACTTCC": 2228, "ACTGAA": 2229, "ACTGAT": 2230, "ACTGAG": 2231, "ACTGAC": 2232, "ACTGTA": 2233, "ACTGTT": 2234, "ACTGTG": 2235, "ACTGTC": 2236, "ACTGGA": 2237, "ACTGGT": 2238, "ACTGGG": 2239, "ACTGGC": 2240, "ACTGCA": 2241, "ACTGCT": 2242, "ACTGCG": 2243, "ACTGCC": 2244, "ACTCAA": 2245, "ACTCAT": 2246, "ACTCAG": 2247, "ACTCAC": 2248, "ACTCTA": 2249, "ACTCTT": 2250, "ACTCTG": 2251, "ACTCTC": 2252, "ACTCGA": 2253, "ACTCGT": 2254, "ACTCGG": 2255, "ACTCGC": 2256, "ACTCCA": 2257, "ACTCCT": 2258, "ACTCCG": 2259, "ACTCCC": 2260, "ACGAAA": 2261, "ACGAAT": 2262, "ACGAAG": 2263, "ACGAAC": 2264, "ACGATA": 2265, "ACGATT": 2266, "ACGATG": 2267, "ACGATC": 2268, "ACGAGA": 2269, "ACGAGT": 2270, "ACGAGG": 2271, "ACGAGC": 2272, "ACGACA": 2273, "ACGACT": 2274, "ACGACG": 2275, "ACGACC": 2276, "ACGTAA": 2277, "ACGTAT": 2278, "ACGTAG": 2279, "ACGTAC": 2280, "ACGTTA": 2281, "ACGTTT": 2282, "ACGTTG": 2283, "ACGTTC": 2284, "ACGTGA": 2285, "ACGTGT": 2286, "ACGTGG": 2287, "ACGTGC": 2288, "ACGTCA": 2289, "ACGTCT": 2290, "ACGTCG": 2291, "ACGTCC": 2292, "ACGGAA": 2293, "ACGGAT": 2294, "ACGGAG": 2295, "ACGGAC": 2296, "ACGGTA": 2297, "ACGGTT": 2298, "ACGGTG": 2299, "ACGGTC": 2300, "ACGGGA": 2301, "ACGGGT": 2302, "ACGGGG": 2303, "ACGGGC": 2304, "ACGGCA": 2305, "ACGGCT": 2306, "ACGGCG": 2307, "ACGGCC": 2308, "ACGCAA": 2309, "ACGCAT": 2310, "ACGCAG": 2311, "ACGCAC": 2312, "ACGCTA": 2313, "ACGCTT": 2314, "ACGCTG": 2315, "ACGCTC": 2316, "ACGCGA": 2317, "ACGCGT": 2318, "ACGCGG": 2319, "ACGCGC": 2320, "ACGCCA": 2321, "ACGCCT": 2322, "ACGCCG": 2323, "ACGCCC": 2324, "ACCAAA": 2325, "ACCAAT": 2326, "ACCAAG": 2327, "ACCAAC": 2328, "ACCATA": 2329, "ACCATT": 2330, "ACCATG": 2331, "ACCATC": 2332, "ACCAGA": 2333, "ACCAGT": 2334, "ACCAGG": 2335, "ACCAGC": 2336, "ACCACA": 2337, "ACCACT": 2338, "ACCACG": 2339, "ACCACC": 2340, "ACCTAA": 2341, "ACCTAT": 2342, "ACCTAG": 2343, "ACCTAC": 2344, "ACCTTA": 2345, "ACCTTT": 2346, "ACCTTG": 2347, "ACCTTC": 2348, "ACCTGA": 2349, "ACCTGT": 2350, "ACCTGG": 2351, "ACCTGC": 2352, "ACCTCA": 2353, "ACCTCT": 2354, "ACCTCG": 2355, "ACCTCC": 2356, "ACCGAA": 2357, "ACCGAT": 2358, "ACCGAG": 2359, "ACCGAC": 2360, "ACCGTA": 2361, "ACCGTT": 2362, "ACCGTG": 2363, "ACCGTC": 2364, "ACCGGA": 2365, "ACCGGT": 2366, "ACCGGG": 2367, "ACCGGC": 2368, "ACCGCA": 2369, "ACCGCT": 2370, "ACCGCG": 2371, "ACCGCC": 2372, "ACCCAA": 2373, "ACCCAT": 2374, "ACCCAG": 2375, "ACCCAC": 2376, "ACCCTA": 2377, "ACCCTT": 2378, "ACCCTG": 2379, "ACCCTC": 2380, "ACCCGA": 2381, "ACCCGT": 2382, "ACCCGG": 2383, "ACCCGC": 2384, "ACCCCA": 2385, "ACCCCT": 2386, "ACCCCG": 2387, "ACCCCC": 2388, "TAAAAA": 2389, "TAAAAT": 2390, "TAAAAG": 2391, "TAAAAC": 2392, "TAAATA": 2393, "TAAATT": 2394, "TAAATG": 2395, "TAAATC": 2396, "TAAAGA": 2397, "TAAAGT": 2398, "TAAAGG": 2399, "TAAAGC": 2400, "TAAACA": 2401, "TAAACT": 2402, "TAAACG": 2403, "TAAACC": 2404, "TAATAA": 2405, "TAATAT": 2406, "TAATAG": 2407, "TAATAC": 2408, "TAATTA": 2409, "TAATTT": 2410, "TAATTG": 2411, "TAATTC": 2412, "TAATGA": 2413, "TAATGT": 2414, "TAATGG": 2415, "TAATGC": 2416, "TAATCA": 2417, "TAATCT": 2418, "TAATCG": 2419, "TAATCC": 2420, "TAAGAA": 2421, "TAAGAT": 2422, "TAAGAG": 2423, "TAAGAC": 2424, "TAAGTA": 2425, "TAAGTT": 2426, "TAAGTG": 2427, "TAAGTC": 2428, "TAAGGA": 2429, "TAAGGT": 2430, "TAAGGG": 2431, "TAAGGC": 2432, "TAAGCA": 2433, "TAAGCT": 2434, "TAAGCG": 2435, "TAAGCC": 2436, "TAACAA": 2437, "TAACAT": 2438, "TAACAG": 2439, "TAACAC": 2440, "TAACTA": 2441, "TAACTT": 2442, "TAACTG": 2443, "TAACTC": 2444, "TAACGA": 2445, "TAACGT": 2446, "TAACGG": 2447, "TAACGC": 2448, "TAACCA": 2449, "TAACCT": 2450, "TAACCG": 2451, "TAACCC": 2452, "TATAAA": 2453, "TATAAT": 2454, "TATAAG": 2455, "TATAAC": 2456, "TATATA": 2457, "TATATT": 2458, "TATATG": 2459, "TATATC": 2460, "TATAGA": 2461, "TATAGT": 2462, "TATAGG": 2463, "TATAGC": 2464, "TATACA": 2465, "TATACT": 2466, "TATACG": 2467, "TATACC": 2468, "TATTAA": 2469, "TATTAT": 2470, "TATTAG": 2471, "TATTAC": 2472, "TATTTA": 2473, "TATTTT": 2474, "TATTTG": 2475, "TATTTC": 2476, "TATTGA": 2477, "TATTGT": 2478, "TATTGG": 2479, "TATTGC": 2480, "TATTCA": 2481, "TATTCT": 2482, "TATTCG": 2483, "TATTCC": 2484, "TATGAA": 2485, "TATGAT": 2486, "TATGAG": 2487, "TATGAC": 2488, "TATGTA": 2489, "TATGTT": 2490, "TATGTG": 2491, "TATGTC": 2492, "TATGGA": 2493, "TATGGT": 2494, "TATGGG": 2495, "TATGGC": 2496, "TATGCA": 2497, "TATGCT": 2498, "TATGCG": 2499, "TATGCC": 2500, "TATCAA": 2501, "TATCAT": 2502, "TATCAG": 2503, "TATCAC": 2504, "TATCTA": 2505, "TATCTT": 2506, "TATCTG": 2507, "TATCTC": 2508, "TATCGA": 2509, "TATCGT": 2510, "TATCGG": 2511, "TATCGC": 2512, "TATCCA": 2513, "TATCCT": 2514, "TATCCG": 2515, "TATCCC": 2516, "TAGAAA": 2517, "TAGAAT": 2518, "TAGAAG": 2519, "TAGAAC": 2520, "TAGATA": 2521, "TAGATT": 2522, "TAGATG": 2523, "TAGATC": 2524, "TAGAGA": 2525, "TAGAGT": 2526, "TAGAGG": 2527, "TAGAGC": 2528, "TAGACA": 2529, "TAGACT": 2530, "TAGACG": 2531, "TAGACC": 2532, "TAGTAA": 2533, "TAGTAT": 2534, "TAGTAG": 2535, "TAGTAC": 2536, "TAGTTA": 2537, "TAGTTT": 2538, "TAGTTG": 2539, "TAGTTC": 2540, "TAGTGA": 2541, "TAGTGT": 2542, "TAGTGG": 2543, "TAGTGC": 2544, "TAGTCA": 2545, "TAGTCT": 2546, "TAGTCG": 2547, "TAGTCC": 2548, "TAGGAA": 2549, "TAGGAT": 2550, "TAGGAG": 2551, "TAGGAC": 2552, "TAGGTA": 2553, "TAGGTT": 2554, "TAGGTG": 2555, "TAGGTC": 2556, "TAGGGA": 2557, "TAGGGT": 2558, "TAGGGG": 2559, "TAGGGC": 2560, "TAGGCA": 2561, "TAGGCT": 2562, "TAGGCG": 2563, "TAGGCC": 2564, "TAGCAA": 2565, "TAGCAT": 2566, "TAGCAG": 2567, "TAGCAC": 2568, "TAGCTA": 2569, "TAGCTT": 2570, "TAGCTG": 2571, "TAGCTC": 2572, "TAGCGA": 2573, "TAGCGT": 2574, "TAGCGG": 2575, "TAGCGC": 2576, "TAGCCA": 2577, "TAGCCT": 2578, "TAGCCG": 2579, "TAGCCC": 2580, "TACAAA": 2581, "TACAAT": 2582, "TACAAG": 2583, "TACAAC": 2584, "TACATA": 2585, "TACATT": 2586, "TACATG": 2587, "TACATC": 2588, "TACAGA": 2589, "TACAGT": 2590, "TACAGG": 2591, "TACAGC": 2592, "TACACA": 2593, "TACACT": 2594, "TACACG": 2595, "TACACC": 2596, "TACTAA": 2597, "TACTAT": 2598, "TACTAG": 2599, "TACTAC": 2600, "TACTTA": 2601, "TACTTT": 2602, "TACTTG": 2603, "TACTTC": 2604, "TACTGA": 2605, "TACTGT": 2606, "TACTGG": 2607, "TACTGC": 2608, "TACTCA": 2609, "TACTCT": 2610, "TACTCG": 2611, "TACTCC": 2612, "TACGAA": 2613, "TACGAT": 2614, "TACGAG": 2615, "TACGAC": 2616, "TACGTA": 2617, "TACGTT": 2618, "TACGTG": 2619, "TACGTC": 2620, "TACGGA": 2621, "TACGGT": 2622, "TACGGG": 2623, "TACGGC": 2624, "TACGCA": 2625, "TACGCT": 2626, "TACGCG": 2627, "TACGCC": 2628, "TACCAA": 2629, "TACCAT": 2630, "TACCAG": 2631, "TACCAC": 2632, "TACCTA": 2633, "TACCTT": 2634, "TACCTG": 2635, "TACCTC": 2636, "TACCGA": 2637, "TACCGT": 2638, "TACCGG": 2639, "TACCGC": 2640, "TACCCA": 2641, "TACCCT": 2642, "TACCCG": 2643, "TACCCC": 2644, "TTAAAA": 2645, "TTAAAT": 2646, "TTAAAG": 2647, "TTAAAC": 2648, "TTAATA": 2649, "TTAATT": 2650, "TTAATG": 2651, "TTAATC": 2652, "TTAAGA": 2653, "TTAAGT": 2654, "TTAAGG": 2655, "TTAAGC": 2656, "TTAACA": 2657, "TTAACT": 2658, "TTAACG": 2659, "TTAACC": 2660, "TTATAA": 2661, "TTATAT": 2662, "TTATAG": 2663, "TTATAC": 2664, "TTATTA": 2665, "TTATTT": 2666, "TTATTG": 2667, "TTATTC": 2668, "TTATGA": 2669, "TTATGT": 2670, "TTATGG": 2671, "TTATGC": 2672, "TTATCA": 2673, "TTATCT": 2674, "TTATCG": 2675, "TTATCC": 2676, "TTAGAA": 2677, "TTAGAT": 2678, "TTAGAG": 2679, "TTAGAC": 2680, "TTAGTA": 2681, "TTAGTT": 2682, "TTAGTG": 2683, "TTAGTC": 2684, "TTAGGA": 2685, "TTAGGT": 2686, "TTAGGG": 2687, "TTAGGC": 2688, "TTAGCA": 2689, "TTAGCT": 2690, "TTAGCG": 2691, "TTAGCC": 2692, "TTACAA": 2693, "TTACAT": 2694, "TTACAG": 2695, "TTACAC": 2696, "TTACTA": 2697, "TTACTT": 2698, "TTACTG": 2699, "TTACTC": 2700, "TTACGA": 2701, "TTACGT": 2702, "TTACGG": 2703, "TTACGC": 2704, "TTACCA": 2705, "TTACCT": 2706, "TTACCG": 2707, "TTACCC": 2708, "TTTAAA": 2709, "TTTAAT": 2710, "TTTAAG": 2711, "TTTAAC": 2712, "TTTATA": 2713, "TTTATT": 2714, "TTTATG": 2715, "TTTATC": 2716, "TTTAGA": 2717, "TTTAGT": 2718, "TTTAGG": 2719, "TTTAGC": 2720, "TTTACA": 2721, "TTTACT": 2722, "TTTACG": 2723, "TTTACC": 2724, "TTTTAA": 2725, "TTTTAT": 2726, "TTTTAG": 2727, "TTTTAC": 2728, "TTTTTA": 2729, "TTTTTT": 2730, "TTTTTG": 2731, "TTTTTC": 2732, "TTTTGA": 2733, "TTTTGT": 2734, "TTTTGG": 2735, "TTTTGC": 2736, "TTTTCA": 2737, "TTTTCT": 2738, "TTTTCG": 2739, "TTTTCC": 2740, "TTTGAA": 2741, "TTTGAT": 2742, "TTTGAG": 2743, "TTTGAC": 2744, "TTTGTA": 2745, "TTTGTT": 2746, "TTTGTG": 2747, "TTTGTC": 2748, "TTTGGA": 2749, "TTTGGT": 2750, "TTTGGG": 2751, "TTTGGC": 2752, "TTTGCA": 2753, "TTTGCT": 2754, "TTTGCG": 2755, "TTTGCC": 2756, "TTTCAA": 2757, "TTTCAT": 2758, "TTTCAG": 2759, "TTTCAC": 2760, "TTTCTA": 2761, "TTTCTT": 2762, "TTTCTG": 2763, "TTTCTC": 2764, "TTTCGA": 2765, "TTTCGT": 2766, "TTTCGG": 2767, "TTTCGC": 2768, "TTTCCA": 2769, "TTTCCT": 2770, "TTTCCG": 2771, "TTTCCC": 2772, "TTGAAA": 2773, "TTGAAT": 2774, "TTGAAG": 2775, "TTGAAC": 2776, "TTGATA": 2777, "TTGATT": 2778, "TTGATG": 2779, "TTGATC": 2780, "TTGAGA": 2781, "TTGAGT": 2782, "TTGAGG": 2783, "TTGAGC": 2784, "TTGACA": 2785, "TTGACT": 2786, "TTGACG": 2787, "TTGACC": 2788, "TTGTAA": 2789, "TTGTAT": 2790, "TTGTAG": 2791, "TTGTAC": 2792, "TTGTTA": 2793, "TTGTTT": 2794, "TTGTTG": 2795, "TTGTTC": 2796, "TTGTGA": 2797, "TTGTGT": 2798, "TTGTGG": 2799, "TTGTGC": 2800, "TTGTCA": 2801, "TTGTCT": 2802, "TTGTCG": 2803, "TTGTCC": 2804, "TTGGAA": 2805, "TTGGAT": 2806, "TTGGAG": 2807, "TTGGAC": 2808, "TTGGTA": 2809, "TTGGTT": 2810, "TTGGTG": 2811, "TTGGTC": 2812, "TTGGGA": 2813, "TTGGGT": 2814, "TTGGGG": 2815, "TTGGGC": 2816, "TTGGCA": 2817, "TTGGCT": 2818, "TTGGCG": 2819, "TTGGCC": 2820, "TTGCAA": 2821, "TTGCAT": 2822, "TTGCAG": 2823, "TTGCAC": 2824, "TTGCTA": 2825, "TTGCTT": 2826, "TTGCTG": 2827, "TTGCTC": 2828, "TTGCGA": 2829, "TTGCGT": 2830, "TTGCGG": 2831, "TTGCGC": 2832, "TTGCCA": 2833, "TTGCCT": 2834, "TTGCCG": 2835, "TTGCCC": 2836, "TTCAAA": 2837, "TTCAAT": 2838, "TTCAAG": 2839, "TTCAAC": 2840, "TTCATA": 2841, "TTCATT": 2842, "TTCATG": 2843, "TTCATC": 2844, "TTCAGA": 2845, "TTCAGT": 2846, "TTCAGG": 2847, "TTCAGC": 2848, "TTCACA": 2849, "TTCACT": 2850, "TTCACG": 2851, "TTCACC": 2852, "TTCTAA": 2853, "TTCTAT": 2854, "TTCTAG": 2855, "TTCTAC": 2856, "TTCTTA": 2857, "TTCTTT": 2858, "TTCTTG": 2859, "TTCTTC": 2860, "TTCTGA": 2861, "TTCTGT": 2862, "TTCTGG": 2863, "TTCTGC": 2864, "TTCTCA": 2865, "TTCTCT": 2866, "TTCTCG": 2867, "TTCTCC": 2868, "TTCGAA": 2869, "TTCGAT": 2870, "TTCGAG": 2871, "TTCGAC": 2872, "TTCGTA": 2873, "TTCGTT": 2874, "TTCGTG": 2875, "TTCGTC": 2876, "TTCGGA": 2877, "TTCGGT": 2878, "TTCGGG": 2879, "TTCGGC": 2880, "TTCGCA": 2881, "TTCGCT": 2882, "TTCGCG": 2883, "TTCGCC": 2884, "TTCCAA": 2885, "TTCCAT": 2886, "TTCCAG": 2887, "TTCCAC": 2888, "TTCCTA": 2889, "TTCCTT": 2890, "TTCCTG": 2891, "TTCCTC": 2892, "TTCCGA": 2893, "TTCCGT": 2894, "TTCCGG": 2895, "TTCCGC": 2896, "TTCCCA": 2897, "TTCCCT": 2898, "TTCCCG": 2899, "TTCCCC": 2900, "TGAAAA": 2901, "TGAAAT": 2902, "TGAAAG": 2903, "TGAAAC": 2904, "TGAATA": 2905, "TGAATT": 2906, "TGAATG": 2907, "TGAATC": 2908, "TGAAGA": 2909, "TGAAGT": 2910, "TGAAGG": 2911, "TGAAGC": 2912, "TGAACA": 2913, "TGAACT": 2914, "TGAACG": 2915, "TGAACC": 2916, "TGATAA": 2917, "TGATAT": 2918, "TGATAG": 2919, "TGATAC": 2920, "TGATTA": 2921, "TGATTT": 2922, "TGATTG": 2923, "TGATTC": 2924, "TGATGA": 2925, "TGATGT": 2926, "TGATGG": 2927, "TGATGC": 2928, "TGATCA": 2929, "TGATCT": 2930, "TGATCG": 2931, "TGATCC": 2932, "TGAGAA": 2933, "TGAGAT": 2934, "TGAGAG": 2935, "TGAGAC": 2936, "TGAGTA": 2937, "TGAGTT": 2938, "TGAGTG": 2939, "TGAGTC": 2940, "TGAGGA": 2941, "TGAGGT": 2942, "TGAGGG": 2943, "TGAGGC": 2944, "TGAGCA": 2945, "TGAGCT": 2946, "TGAGCG": 2947, "TGAGCC": 2948, "TGACAA": 2949, "TGACAT": 2950, "TGACAG": 2951, "TGACAC": 2952, "TGACTA": 2953, "TGACTT": 2954, "TGACTG": 2955, "TGACTC": 2956, "TGACGA": 2957, "TGACGT": 2958, "TGACGG": 2959, "TGACGC": 2960, "TGACCA": 2961, "TGACCT": 2962, "TGACCG": 2963, "TGACCC": 2964, "TGTAAA": 2965, "TGTAAT": 2966, "TGTAAG": 2967, "TGTAAC": 2968, "TGTATA": 2969, "TGTATT": 2970, "TGTATG": 2971, "TGTATC": 2972, "TGTAGA": 2973, "TGTAGT": 2974, "TGTAGG": 2975, "TGTAGC": 2976, "TGTACA": 2977, "TGTACT": 2978, "TGTACG": 2979, "TGTACC": 2980, "TGTTAA": 2981, "TGTTAT": 2982, "TGTTAG": 2983, "TGTTAC": 2984, "TGTTTA": 2985, "TGTTTT": 2986, "TGTTTG": 2987, "TGTTTC": 2988, "TGTTGA": 2989, "TGTTGT": 2990, "TGTTGG": 2991, "TGTTGC": 2992, "TGTTCA": 2993, "TGTTCT": 2994, "TGTTCG": 2995, "TGTTCC": 2996, "TGTGAA": 2997, "TGTGAT": 2998, "TGTGAG": 2999, "TGTGAC": 3000, "TGTGTA": 3001, "TGTGTT": 3002, "TGTGTG": 3003, "TGTGTC": 3004, "TGTGGA": 3005, "TGTGGT": 3006, "TGTGGG": 3007, "TGTGGC": 3008, "TGTGCA": 3009, "TGTGCT": 3010, "TGTGCG": 3011, "TGTGCC": 3012, "TGTCAA": 3013, "TGTCAT": 3014, "TGTCAG": 3015, "TGTCAC": 3016, "TGTCTA": 3017, "TGTCTT": 3018, "TGTCTG": 3019, "TGTCTC": 3020, "TGTCGA": 3021, "TGTCGT": 3022, "TGTCGG": 3023, "TGTCGC": 3024, "TGTCCA": 3025, "TGTCCT": 3026, "TGTCCG": 3027, "TGTCCC": 3028, "TGGAAA": 3029, "TGGAAT": 3030, "TGGAAG": 3031, "TGGAAC": 3032, "TGGATA": 3033, "TGGATT": 3034, "TGGATG": 3035, "TGGATC": 3036, "TGGAGA": 3037, "TGGAGT": 3038, "TGGAGG": 3039, "TGGAGC": 3040, "TGGACA": 3041, "TGGACT": 3042, "TGGACG": 3043, "TGGACC": 3044, "TGGTAA": 3045, "TGGTAT": 3046, "TGGTAG": 3047, "TGGTAC": 3048, "TGGTTA": 3049, "TGGTTT": 3050, "TGGTTG": 3051, "TGGTTC": 3052, "TGGTGA": 3053, "TGGTGT": 3054, "TGGTGG": 3055, "TGGTGC": 3056, "TGGTCA": 3057, "TGGTCT": 3058, "TGGTCG": 3059, "TGGTCC": 3060, "TGGGAA": 3061, "TGGGAT": 3062, "TGGGAG": 3063, "TGGGAC": 3064, "TGGGTA": 3065, "TGGGTT": 3066, "TGGGTG": 3067, "TGGGTC": 3068, "TGGGGA": 3069, "TGGGGT": 3070, "TGGGGG": 3071, "TGGGGC": 3072, "TGGGCA": 3073, "TGGGCT": 3074, "TGGGCG": 3075, "TGGGCC": 3076, "TGGCAA": 3077, "TGGCAT": 3078, "TGGCAG": 3079, "TGGCAC": 3080, "TGGCTA": 3081, "TGGCTT": 3082, "TGGCTG": 3083, "TGGCTC": 3084, "TGGCGA": 3085, "TGGCGT": 3086, "TGGCGG": 3087, "TGGCGC": 3088, "TGGCCA": 3089, "TGGCCT": 3090, "TGGCCG": 3091, "TGGCCC": 3092, "TGCAAA": 3093, "TGCAAT": 3094, "TGCAAG": 3095, "TGCAAC": 3096, "TGCATA": 3097, "TGCATT": 3098, "TGCATG": 3099, "TGCATC": 3100, "TGCAGA": 3101, "TGCAGT": 3102, "TGCAGG": 3103, "TGCAGC": 3104, "TGCACA": 3105, "TGCACT": 3106, "TGCACG": 3107, "TGCACC": 3108, "TGCTAA": 3109, "TGCTAT": 3110, "TGCTAG": 3111, "TGCTAC": 3112, "TGCTTA": 3113, "TGCTTT": 3114, "TGCTTG": 3115, "TGCTTC": 3116, "TGCTGA": 3117, "TGCTGT": 3118, "TGCTGG": 3119, "TGCTGC": 3120, "TGCTCA": 3121, "TGCTCT": 3122, "TGCTCG": 3123, "TGCTCC": 3124, "TGCGAA": 3125, "TGCGAT": 3126, "TGCGAG": 3127, "TGCGAC": 3128, "TGCGTA": 3129, "TGCGTT": 3130, "TGCGTG": 3131, "TGCGTC": 3132, "TGCGGA": 3133, "TGCGGT": 3134, "TGCGGG": 3135, "TGCGGC": 3136, "TGCGCA": 3137, "TGCGCT": 3138, "TGCGCG": 3139, "TGCGCC": 3140, "TGCCAA": 3141, "TGCCAT": 3142, "TGCCAG": 3143, "TGCCAC": 3144, "TGCCTA": 3145, "TGCCTT": 3146, "TGCCTG": 3147, "TGCCTC": 3148, "TGCCGA": 3149, "TGCCGT": 3150, "TGCCGG": 3151, "TGCCGC": 3152, "TGCCCA": 3153, "TGCCCT": 3154, "TGCCCG": 3155, "TGCCCC": 3156, "TCAAAA": 3157, "TCAAAT": 3158, "TCAAAG": 3159, "TCAAAC": 3160, "TCAATA": 3161, "TCAATT": 3162, "TCAATG": 3163, "TCAATC": 3164, "TCAAGA": 3165, "TCAAGT": 3166, "TCAAGG": 3167, "TCAAGC": 3168, "TCAACA": 3169, "TCAACT": 3170, "TCAACG": 3171, "TCAACC": 3172, "TCATAA": 3173, "TCATAT": 3174, "TCATAG": 3175, "TCATAC": 3176, "TCATTA": 3177, "TCATTT": 3178, "TCATTG": 3179, "TCATTC": 3180, "TCATGA": 3181, "TCATGT": 3182, "TCATGG": 3183, "TCATGC": 3184, "TCATCA": 3185, "TCATCT": 3186, "TCATCG": 3187, "TCATCC": 3188, "TCAGAA": 3189, "TCAGAT": 3190, "TCAGAG": 3191, "TCAGAC": 3192, "TCAGTA": 3193, 