{"0": "______", "1": "A_____", "2": "T_____", "3": "G_____", "4": "C_____", "5": "AA____", "6": "AT____", "7": "AG____", "8": "AC____", "9": "TA____", "10": "TT____", "11": "TG____", "12": "TC____", "13": "GA____", "14": "GT____", "15": "GG____", "16": "GC____", "17": "CA____", "18": "CT____", "19": "CG____", "20": "CC____", "21": "AAA___", "22": "AAT___", "23": "AAG___", "24": "AAC___", "25": "ATA___", "26": "ATT___", "27": "ATG___", "28": "ATC___", "29": "AGA___", "30": "AGT___", "31": "AGG___", "32": "AGC___", "33": "ACA___", "34": "ACT___", "35": "ACG___", "36": "ACC___", "37": "TAA___", "38": "TAT___", "39": "TAG___", "40": "TAC___", "41": "TTA___", "42": "TTT___", "43": "TTG___", "44": "TTC___", "45": "TGA___", "46": "TGT___", "47": "TGG___", "48": "TGC___", "49": "TCA___", "50": "TCT___", "51": "TCG___", "52": "TCC___", "53": "GAA___", "54": "GAT___", "55": "GAG___", "56": "GAC___", "57": "GTA___", "58": "GTT___", "59": "GTG___", "60": "GTC___", "61": "GGA___", "62": "GGT___", "63": "GGG___", "64": "GGC___", "65": "GCA___", "66": "GCT___", "67": "GCG___", "68": "GCC___", "69": "CAA___", "70": "CAT___", "71": "CAG___", "72": "CAC___", "73": "CTA___", "74": "CTT___", "75": "CTG___", "76": "CTC___", "77": "CGA___", "78": "CGT___", "79": "CGG___", "80": "CGC___", "81": "CCA___", "82": "CCT___", "83": "CCG___", "84": "CCC___", "85": "AAAA__", "86": "AAAT__", "87": "AAAG__", "88": "AAAC__", "89": "AATA__", "90": "AATT__", "91": "AATG__", "92": "AATC__", "93": "AAGA__", "94": "AAGT__", "95": "AAGG__", "96": "AAGC__", "97": "AACA__", "98": "AACT__", "99": "AACG__", "100": "AACC__", "101": "ATAA__", "102": "ATAT__", "103": "ATAG__", "104": "ATAC__", "105": "ATTA__", "106": "ATTT__", "107": "ATTG__", "108": "ATTC__", "109": "ATGA__", "110": "ATGT__", "111": "ATGG__", "112": "ATGC__", "113": "ATCA__", "114": "ATCT__", "115": "ATCG__", "116": "ATCC__", "117": "AGAA__", "118": "AGAT__", "119": "AGAG__", "120": "AGAC__", "121": "AGTA__", "122": "AGTT__", "123": "AGTG__", "124": "AGTC__", "125": "AGGA__", "126": "AGGT__", "127": "AGGG__", "128": "AGGC__", "129": "AGCA__", "130": "AGCT__", "131": "AGCG__", "132": "AGCC__", "133": "ACAA__", "134": "ACAT__", "135": "ACAG__", "136": "ACAC__", "137": "ACTA__", "138": "ACTT__", "139": "ACTG__", "140": "ACTC__", "141": "ACGA__", "142": "ACGT__", "143": "ACGG__", "144": "ACGC__", "145": "ACCA__", "146": "ACCT__", "147": "ACCG__", "148": "ACCC__", "149": "TAAA__", "150": "TAAT__", "151": "TAAG__", "152": "TAAC__", "153": "TATA__", "154": "TATT__", "155": "TATG__", "156": "TATC__", "157": "TAGA__", "158": "TAGT__", "159": "TAGG__", "160": "TAGC__", "161": "TACA__", "162": "TACT__", "163": "TACG__", "164": "TACC__", "165": "TTAA__", "166": "TTAT__", "167": "TTAG__", "168": "TTAC__", "169": "TTTA__", "170": "TTTT__", "171": "TTTG__", "172": "TTTC__", "173": "TTGA__", "174": "TTGT__", "175": "TTGG__", "176": "TTGC__", "177": "TTCA__", "178": "TTCT__", "179": "TTCG__", "180": "TTCC__", "181": "TGAA__", "182": "TGAT__", "183": "TGAG__", "184": "TGAC__", "185": "TGTA__", "186": "TGTT__", "187": "TGTG__", "188": "TGTC__", "189": "TGGA__", "190": "TGGT__", "191": "TGGG__", "192": "TGGC__", "193": "TGCA__", "194": "TGCT__", "195": "TGCG__", "196": "TGCC__", "197": "TCAA__", "198": "TCAT__", "199": "TCAG__", "200": "TCAC__", "201": "TCTA__", "202": "TCTT__", "203": "TCTG__", "204": "TCTC__", "205": "TCGA__", "206": "TCGT__", "207": "TCGG__", "208": "TCGC__", "209": "TCCA__", "210": "TCCT__", "211": "TCCG__", "212": "TCCC__", "213": "GAAA__", "214": "GAAT__", "215": "GAAG__", "216": "GAAC__", "217": "GATA__", "218": "GATT__", "219": "GATG__", "220": "GATC__", "221": "GAGA__", "222": "GAGT__", "223": "GAGG__", "224": "GAGC__", "225": "GACA__", "226": "GACT__", "227": "GACG__", "228": "GACC__", "229": "GTAA__", "230": "GTAT__", "231": "GTAG__", "232": "GTAC__", "233": "GTTA__", "234": "GTTT__", "235": "GTTG__", "236": "GTTC__", "237": "GTGA__", "238": "GTGT__", "239": "GTGG__", "240": "GTGC__", "241": "GTCA__", "242": "GTCT__", "243": "GTCG__", "244": "GTCC__", "245": "GGAA__", "246": "GGAT__", "247": "GGAG__", "248": "GGAC__", "249": "GGTA__", "250": "GGTT__", "251": "GGTG__", "252": "GGTC__", "253": "GGGA__", "254": "GGGT__", "255": "GGGG__", "256": "GGGC__", "257": "GGCA__", "258": "GGCT__", "259": "GGCG__", "260": "GGCC__", "261": "GCAA__", "262": "GCAT__", "263": "GCAG__", "264": "GCAC__", "265": "GCTA__", "266": "GCTT__", "267": "GCTG__", "268": "GCTC__", "269": "GCGA__", "270": "GCGT__", "271": "GCGG__", "272": "GCGC__", "273": "GCCA__", "274": "GCCT__", "275": "GCCG__", "276": "GCCC__", "277": "CAAA__", "278": "CAAT__", "279": "CAAG__", "280": "CAAC__", "281": "CATA__", "282": "CATT__", "283": "CATG__", "284": "CATC__", "285": "CAGA__", "286": "CAGT__", "287": "CAGG__", "288": "CAGC__", "289": "CACA__", "290": "CACT__", "291": "CACG__", "292": "CACC__", "293": "CTAA__", "294": "CTAT__", "295": "CTAG__", "296": "CTAC__", "297": "CTTA__", "298": "CTTT__", "299": "CTTG__", "300": "CTTC__", "301": "CTGA__", "302": "CTGT__", "303": "CTGG__", "304": "CTGC__", "305": "CTCA__", "306": "CTCT__", "307": "CTCG__", "308": "CTCC__", "309": "CGAA__", "310": "CGAT__", "311": "CGAG__", "312": "CGAC__", "313": "CGTA__", "314": "CGTT__", "315": "CGTG__", "316": "CGTC__", "317": "CGGA__", "318": "CGGT__", "319": "CGGG__", "320": "CGGC__", "321": "CGCA__", "322": "CGCT__", "323": "CGCG__", "324": "CGCC__", "325": "CCAA__", "326": "CCAT__", "327": "CCAG__", "328": "CCAC__", "329": "CCTA__", "330": "CCTT__", "331": "CCTG__", "332": "CCTC__", "333": "CCGA__", "334": "CCGT__", "335": "CCGG__", "336": "CCGC__", "337": "CCCA__", "338": "CCCT__", "339": "CCCG__", "340": "CCCC__", "341": "AAAAA_", "342": "AAAAT_", "343": "AAAAG_", "344": "AAAAC_", "345": "AAATA_", "346": "AAATT_", "347": "AAATG_", "348": "AAATC_", "349": "AAAGA_", "350": "AAAGT_", "351": "AAAGG_", "352": "AAAGC_", "353": "AAACA_", "354": "AAACT_", "355": "AAACG_", "356": "AAACC_", "357": "AATAA_", "358": "AATAT_", "359": "AATAG_", "360": "AATAC_", "361": "AATTA_", "362": "AATTT_", "363": "AATTG_", "364": "AATTC_", "365": "AATGA_", "366": "AATGT_", "367": "AATGG_", "368": "AATGC_", "369": "AATCA_", "370": "AATCT_", "371": "AATCG_", "372": "AATCC_", "373": "AAGAA_", "374": "AAGAT_", "375": "AAGAG_", "376": "AAGAC_", "377": "AAGTA_", "378": "AAGTT_", "379": "AAGTG_", "380": "AAGTC_", "381": "AAGGA_", "382": "AAGGT_", "383": "AAGGG_", "384": "AAGGC_", "385": "AAGCA_", "386": "AAGCT_", "387": "AAGCG_", "388": "AAGCC_", "389": "AACAA_", "390": "AACAT_", "391": "AACAG_", "392": "AACAC_", "393": "AACTA_", "394": "AACTT_", "395": "AACTG_", "396": "AACTC_", "397": "AACGA_", "398": "AACGT_", "399": "AACGG_", "400": "AACGC_", "401": "AACCA_", "402": "AACCT_", "403": "AACCG_", "404": "AACCC_", "405": "ATAAA_", "406": "ATAAT_", "407": "ATAAG_", "408": "ATAAC_", "409": "ATATA_", "410": "ATATT_", "411": "ATATG_", "412": "ATATC_", "413": "ATAGA_", "414": "ATAGT_", "415": "ATAGG_", "416": "ATAGC_", "417": "ATACA_", "418": "ATACT_", "419": "ATACG_", "420": "ATACC_", "421": "ATTAA_", "422": "ATTAT_", "423": "ATTAG_", "424": "ATTAC_", "425": "ATTTA_", "426": "ATTTT_", "427": "ATTTG_", "428": "ATTTC_", "429": "ATTGA_", "430": "ATTGT_", "431": "ATTGG_", "432": "ATTGC_", "433": "ATTCA_", "434": "ATTCT_", "435": "ATTCG_", "436": "ATTCC_", "437": "ATGAA_", "438": "ATGAT_", "439": "ATGAG_", "440": "ATGAC_", "441": "ATGTA_", "442": "ATGTT_", "443": "ATGTG_", "444": "ATGTC_", "445": "ATGGA_", "446": "ATGGT_", "447": "ATGGG_", "448": "ATGGC_", "449": "ATGCA_", "450": "ATGCT_", "451": "ATGCG_", "452": "ATGCC_", "453": "ATCAA_", "454": "ATCAT_", "455": "ATCAG_", "456": "ATCAC_", "457": "ATCTA_", "458": "ATCTT_", "459": "ATCTG_", "460": "ATCTC_", "461": "ATCGA_", "462": "ATCGT_", "463": "ATCGG_", "464": "ATCGC_", "465": "ATCCA_", "466": "ATCCT_", "467": "ATCCG_", "468": "ATCCC_", "469": "AGAAA_", "470": "AGAAT_", "471": "AGAAG_", "472": "AGAAC_", "473": "AGATA_", "474": "AGATT_", "475": "AGATG_", "476": "AGATC_", "477": "AGAGA_", "478": "AGAGT_", "479": "AGAGG_", "480": "AGAGC_", "481": "AGACA_", "482": "AGACT_", "483": "AGACG_", "484": "AGACC_", "485": "AGTAA_", "486": "AGTAT_", "487": "AGTAG_", "488": "AGTAC_", "489": "AGTTA_", "490": "AGTTT_", "491": "AGTTG_", "492": "AGTTC_", "493": "AGTGA_", "494": "AGTGT_", "495": "AGTGG_", "496": "AGTGC_", "497": "AGTCA_", "498": "AGTCT_", "499": "AGTCG_", "500": "AGTCC_", "501": "AGGAA_", "502": "AGGAT_", "503": "AGGAG_", "504": "AGGAC_", "505": "AGGTA_", "506": "AGGTT_", "507": "AGGTG_", "508": "AGGTC_", "509": "AGGGA_", "510": "AGGGT_", "511": "AGGGG_", "512": "AGGGC_", "513": "AGGCA_", "514": "AGGCT_", "515": "AGGCG_", "516": "AGGCC_", "517": "AGCAA_", "518": "AGCAT_", "519": "AGCAG_", "520": "AGCAC_", "521": "AGCTA_", "522": "AGCTT_", "523": "AGCTG_", "524": "AGCTC_", "525": "AGCGA_", "526": "AGCGT_", "527": "AGCGG_", "528": "AGCGC_", "529": "AGCCA_", "530": "AGCCT_", "531": "AGCCG_", "532": "AGCCC_", "533": "ACAAA_", "534": "ACAAT_", "535": "ACAAG_", "536": "ACAAC_", "537": "ACATA_", "538": "ACATT_", "539": "ACATG_", "540": "ACATC_", "541": "ACAGA_", "542": "ACAGT_", "543": "ACAGG_", "544": "ACAGC_", "545": "ACACA_", "546": "ACACT_", "547": "ACACG_", "548": "ACACC_", "549": "ACTAA_", "550": "ACTAT_", "551": "ACTAG_", "552": "ACTAC_", "553": "ACTTA_", "554": "ACTTT_", "555": "ACTTG_", "556": "ACTTC_", "557": "ACTGA_", "558": "ACTGT_", "559": "ACTGG_", "560": "ACTGC_", "561": "ACTCA_", "562": "ACTCT_", "563": "ACTCG_", "564": "ACTCC_", "565": "ACGAA_", "566": "ACGAT_", "567": "ACGAG_", "568": "ACGAC_", "569": "ACGTA_", "570": "ACGTT_", "571": "ACGTG_", "572": "ACGTC_", "573": "ACGGA_", "574": "ACGGT_", "575": "ACGGG_", "576": "ACGGC_", "577": "ACGCA_", "578": "ACGCT_", "579": "ACGCG_", "580": "ACGCC_", "581": "ACCAA_", "582": "ACCAT_", "583": "ACCAG_", "584": "ACCAC_", "585": "ACCTA_", "586": "ACCTT_", "587": "ACCTG_", "588": "ACCTC_", "589": "ACCGA_", "590": "ACCGT_", "591": "ACCGG_", "592": "ACCGC_", "593": "ACCCA_", "594": "ACCCT_", "595": "ACCCG_", "596": "ACCCC_", "597": "TAAAA_", "598": "TAAAT_", "599": "TAAAG_", "600": "TAAAC_", "601": "TAATA_", "602": "TAATT_", "603": "TAATG_", "604": "TAATC_", "605": "TAAGA_", "606": "TAAGT_", "607": "TAAGG_", "608": "TAAGC_", "609": "TAACA_", "610": "TAACT_", "611": "TAACG_", "612": "TAACC_", "613": "TATAA_", "614": "TATAT_", "615": "TATAG_", "616": "TATAC_", "617": "TATTA_", "618": "TATTT_", "619": "TATTG_", "620": "TATTC_", "621": "TATGA_", "622": "TATGT_", "623": "TATGG_", "624": "TATGC_", "625": "TATCA_", "626": "TATCT_", "627": "TATCG_", "628": "TATCC_", "629": "TAGAA_", "630": "TAGAT_", "631": "TAGAG_", "632": "TAGAC_", "633": "TAGTA_", "634": "TAGTT_", "635": "TAGTG_", "636": "TAGTC_", "637": "TAGGA_", "638": "TAGGT_", "639": "TAGGG_", "640": "TAGGC_", "641": "TAGCA_", "642": "TAGCT_", "643": "TAGCG_", "644": "TAGCC_", "645": "TACAA_", "646": "TACAT_", "647": "TACAG_", "648": "TACAC_", "649": "TACTA_", "650": "TACTT_", "651": "TACTG_", "652": "TACTC_", "653": "TACGA_", "654": "TACGT_", "655": "TACGG_", "656": "TACGC_", "657": "TACCA_", "658": "TACCT_", "659": "TACCG_", "660": "TACCC_", "661": "TTAAA_", "662": "TTAAT_", "663": "TTAAG_", "664": "TTAAC_", "665": "TTATA_", "666": "TTATT_", "667": "TTATG_", "668": "TTATC_", "669": "TTAGA_", "670": "TTAGT_", "671": "TTAGG_", "672": "TTAGC_", "673": "TTACA_", "674": "TTACT_", "675": "TTACG_", "676": "TTACC_", "677": "TTTAA_", "678": "TTTAT_", "679": "TTTAG_", "680": "TTTAC_", "681": "TTTTA_", "682": "TTTTT_", "683": "TTTTG_", "684": "TTTTC_", "685": "TTTGA_", "686": "TTTGT_", "687": "TTTGG_", "688": "TTTGC_", "689": "TTTCA_", "690": "TTTCT_", "691": "TTTCG_", "692": "TTTCC_", "693": "TTGAA_", "694": "TTGAT_", "695": "TTGAG_", "696": "TTGAC_", "697": "TTGTA_", "698": "TTGTT_", "699": "TTGTG_", "700": "TTGTC_", "701": "TTGGA_", "702": "TTGGT_", "703": "TTGGG_", "704": "TTGGC_", "705": "TTGCA_", "706": "TTGCT_", "707": "TTGCG_", "708": "TTGCC_", "709": "TTCAA_", "710": "TTCAT_", "711": "TTCAG_", "712": "TTCAC_", "713": "TTCTA_", "714": "TTCTT_", "715": "TTCTG_", "716": "TTCTC_", "717": "TTCGA_", "718": "TTCGT_", "719": "TTCGG_", "720": "TTCGC_", "721": "TTCCA_", "722": "TTCCT_", "723": "TTCCG_", "724": "TTCCC_", "725": "TGAAA_", "726": "TGAAT_", "727": "TGAAG_", "728": "TGAAC_", "729": "TGATA_", "730": "TGATT_", "731": "TGATG_", "732": "TGATC_", "733": "TGAGA_", "734": "TGAGT_", "735": "TGAGG_", "736": "TGAGC_", "737": "TGACA_", "738": "TGACT_", "739": "TGACG_", "740": "TGACC_", "741": "TGTAA_", "742": "TGTAT_", "743": "TGTAG_", "744": "TGTAC_", "745": "TGTTA_", "746": "TGTTT_", "747": "TGTTG_", "748": "TGTTC_", "749": "TGTGA_", "750": "TGTGT_", "751": "TGTGG_", "752": "TGTGC_", "753": "TGTCA_", "754": "TGTCT_", "755": "TGTCG_", "756": "TGTCC_", "757": "TGGAA_", "758": "TGGAT_", "759": "TGGAG_", "760": "TGGAC_", "761": "TGGTA_", "762": "TGGTT_", "763": "TGGTG_", "764": "TGGTC_", "765": "TGGGA_", "766": "TGGGT_", "767": "TGGGG_", "768": "TGGGC_", "769": "TGGCA_", "770": "TGGCT_", "771": "TGGCG_", "772": "TGGCC_", "773": "TGCAA_", "774": "TGCAT_", "775": "TGCAG_", "776": "TGCAC_", "777": "TGCTA_", "778": "TGCTT_", "779": "TGCTG_", "780": "TGCTC_", "781": "TGCGA_", "782": "TGCGT_", "783": "TGCGG_", "784": "TGCGC_", "785": "TGCCA_", "786": "TGCCT_", "787": "TGCCG_", "788": "TGCCC_", "789": "TCAAA_", "790": "TCAAT_", "791": "TCAAG_", "792": "TCAAC_", "793": "TCATA_", "794": "TCATT_", "795": "TCATG_", "796": "TCATC_", "797": "TCAGA_", "798": "TCAGT_", "799": "TCAGG_", "800": "TCAGC_", "801": "TCACA_", "802": "TCACT_", "803": "TCACG_", "804": "TCACC_", "805": "TCTAA_", "806": "TCTAT_", "807": "TCTAG_", "808": "TCTAC_", "809": "TCTTA_", "810": "TCTTT_", "811": "TCTTG_", "812": "TCTTC_", "813": "TCTGA_", "814": "TCTGT_", "815": "TCTGG_", "816": "TCTGC_", "817": "TCTCA_", "818": "TCTCT_", "819": "TCTCG_", "820": "TCTCC_", "821": "TCGAA_", "822": "TCGAT_", "823": "TCGAG_", "824": "TCGAC_", "825": "TCGTA_", "826": "TCGTT_", "827": "TCGTG_", "828": "TCGTC_", "829": "TCGGA_", "830": "TCGGT_", "831": "TCGGG_", "832": "TCGGC_", "833": "TCGCA_", "834": "TCGCT_", "835": "TCGCG_", "836": "TCGCC_", "837": "TCCAA_", "838": "TCCAT_", "839": "TCCAG_", "840": "TCCAC_", "841": "TCCTA_", "842": "TCCTT_", "843": "TCCTG_", "844": "TCCTC_", "845": "TCCGA_", "846": "TCCGT_", "847": "TCCGG_", "848": "TCCGC_", "849": "TCCCA_", "850": "TCCCT_", "851": "TCCCG_", "852": "TCCCC_", "853": "GAAAA_", "854": "GAAAT_", "855": "GAAAG_", "856": "GAAAC_", "857": "GAATA_", "858": "GAATT_", "859": "GAATG_", "860": "GAATC_", "861": "GAAGA_", "862": "GAAGT_", "863": "GAAGG_", "864": "GAAGC_", "865": "GAACA_", "866": "GAACT_", "867": "GAACG_", "868": "GAACC_", "869": "GATAA_", "870": "GATAT_", "871": "GATAG_", "872": "GATAC_", "873": "GATTA_", "874": "GATTT_", "875": "GATTG_", "876": "GATTC_", "877": "GATGA_", "878": "GATGT_", "879": "GATGG_", "880": "GATGC_", "881": "GATCA_", "882": "GATCT_", "883": "GATCG_", "884": "GATCC_", "885": "GAGAA_", "886": "GAGAT_", "887": "GAGAG_", "888": "GAGAC_", "889": "GAGTA_", "890": "GAGTT_", "891": "GAGTG_", "892": "GAGTC_", "893": "GAGGA_", "894": "GAGGT_", "895": "GAGGG_", "896": "GAGGC_", "897": "GAGCA_", "898": "GAGCT_", "899": "GAGCG_", "900": "GAGCC_", "901": "GACAA_", "902": "GACAT_", "903": "GACAG_", "904": "GACAC_", "905": "GACTA_", "906": "GACTT_", "907": "GACTG_", "908": "GACTC_", "909": "GACGA_", "910": "GACGT_", "911": "GACGG_", "912": "GACGC_", "913": "GACCA_", "914": "GACCT_", "915": "GACCG_", "916": "GACCC_", "917": "GTAAA_", "918": "GTAAT_", "919": "GTAAG_", "920": "GTAAC_", "921": "GTATA_", "922": "GTATT_", "923": "GTATG_", "924": "GTATC_", "925": "GTAGA_", "926": "GTAGT_", "927": "GTAGG_", "928": "GTAGC_", "929": "GTACA_", "930": "GTACT_", "931": "GTACG_", "932": "GTACC_", "933": "GTTAA_", "934": "GTTAT_", "935": "GTTAG_", "936": "GTTAC_", "937": "GTTTA_", "938": "GTTTT_", "939": "GTTTG_", "940": "GTTTC_", "941": "GTTGA_", "942": "GTTGT_", "943": "GTTGG_", "944": "GTTGC_", "945": "GTTCA_", "946": "GTTCT_", "947": "GTTCG_", "948": "GTTCC_", "949": "GTGAA_", "950": "GTGAT_", "951": "GTGAG_", "952": "GTGAC_", "953": "GTGTA_", "954": "GTGTT_", "955": "GTGTG_", "956": "GTGTC_", "957": "GTGGA_", "958": "GTGGT_", "959": "GTGGG_", "960": "GTGGC_", "961": "GTGCA_", "962": "GTGCT_", "963": "GTGCG_", "964": "GTGCC_", "965": "GTCAA_", "966": "GTCAT_", "967": "GTCAG_", "968": "GTCAC_", "969": "GTCTA_", "970": "GTCTT_", "971": "GTCTG_", "972": "GTCTC_", "973": "GTCGA_", "974": "GTCGT_", "975": "GTCGG_", "976": "GTCGC_", "977": "GTCCA_", "978": "GTCCT_", "979": "GTCCG_", "980": "GTCCC_", "981": "GGAAA_", "982": "GGAAT_", "983": "GGAAG_", "984": "GGAAC_", "985": "GGATA_", "986": "GGATT_", "987": "GGATG_", "988": "GGATC_", "989": "GGAGA_", "990": "GGAGT_", "991": "GGAGG_", "992": "GGAGC_", "993": "GGACA_", "994": "GGACT_", "995": "GGACG_", "996": "GGACC_", "997": "GGTAA_", "998": "GGTAT_", "999": "GGTAG_", "1000": "GGTAC_", "1001": "GGTTA_", "1002": "GGTTT_", "1003": "GGTTG_", "1004": "GGTTC_", "1005": "GGTGA_", "1006": "GGTGT_", "1007": "GGTGG_", "1008": "GGTGC_", "1009": "GGTCA_", "1010": "GGTCT_", "1011": "GGTCG_", "1012": "GGTCC_", "1013": "GGGAA_", "1014": "GGGAT_", "1015": "GGGAG_", "1016": "GGGAC_", "1017": "GGGTA_", "1018": "GGGTT_", "1019": "GGGTG_", "1020": "GGGTC_", "1021": "GGGGA_", "1022": "GGGGT_", "1023": "GGGGG_", "1024": "GGGGC_", "1025": "GGGCA_", "1026": "GGGCT_", "1027": "GGGCG_", "1028": "GGGCC_", "1029": "GGCAA_", "1030": "GGCAT_", "1031": "GGCAG_", "1032": "GGCAC_", "1033": "GGCTA_", "1034": "GGCTT_", "1035": "GGCTG_", "1036": "GGCTC_", "1037": "GGCGA_", "1038": "GGCGT_", "1039": "GGCGG_", "1040": "GGCGC_", "1041": "GGCCA_", "1042": "GGCCT_", "1043": "GGCCG_", "1044": "GGCCC_", "1045": "GCAAA_", "1046": "GCAAT_", "1047": "GCAAG_", "1048": "GCAAC_", "1049": "GCATA_", "1050": "GCATT_", "1051": "GCATG_", "1052": "GCATC_", "1053": "GCAGA_", "1054": "GCAGT_", "1055": "GCAGG_", "1056": "GCAGC_", "1057": "GCACA_", "1058": "GCACT_", "1059": "GCACG_", "1060": "GCACC_", "1061": "GCTAA_", "1062": "GCTAT_", "1063": "GCTAG_", "1064": "GCTAC_", "1065": "GCTTA_", "1066": "GCTTT_", "1067": "GCTTG_", "1068": "GCTTC_", "1069": "GCTGA_", "1070": "GCTGT_", "1071": "GCTGG_", "1072": "GCTGC_", "1073": "GCTCA_", "1074": "GCTCT_", "1075": "GCTCG_", "1076": "GCTCC_", "1077": "GCGAA_", "1078": "GCGAT_", "1079": "GCGAG_", "1080": "GCGAC_", "1081": "GCGTA_", "1082": "GCGTT_", "1083": "GCGTG_", "1084": "GCGTC_", "1085": "GCGGA_", "1086": "GCGGT_", "1087": "GCGGG_", "1088": "GCGGC_", "1089": "GCGCA_", "1090": "GCGCT_", "1091": "GCGCG_", "1092": "GCGCC_", "1093": "GCCAA_", "1094": "GCCAT_", "1095": "GCCAG_", "1096": "GCCAC_", "1097": "GCCTA_", "1098": "GCCTT_", "1099": "GCCTG_", "1100": "GCCTC_", "1101": "GCCGA_", "1102": "GCCGT_", "1103": "GCCGG_", "1104": "GCCGC_", "1105": "GCCCA_", "1106": "GCCCT_", "1107": "GCCCG_", "1108": "GCCCC_", "1109": "CAAAA_", "1110": "CAAAT_", "1111": "CAAAG_", "1112": "CAAAC_", "1113": "CAATA_", "1114": "CAATT_", "1115": "CAATG_", "1116": "CAATC_", "1117": "CAAGA_", "1118": "CAAGT_", "1119": "CAAGG_", "1120": "CAAGC_", "1121": "CAACA_", "1122": "CAACT_", "1123": "CAACG_", "1124": "CAACC_", "1125": "CATAA_", "1126": "CATAT_", "1127": "CATAG_", "1128": "CATAC_", "1129": "CATTA_", "1130": "CATTT_", "1131": "CATTG_", "1132": "CATTC_", "1133": "CATGA_", "1134": "CATGT_", "1135": "CATGG_", "1136": "CATGC_", "1137": "CATCA_", "1138": "CATCT_", "1139": "CATCG_", "1140": "CATCC_", "1141": "CAGAA_", "1142": "CAGAT_", "1143": "CAGAG_", "1144": "CAGAC_", "1145": "CAGTA_", "1146": "CAGTT_", "1147": "CAGTG_", "1148": "CAGTC_", "1149": "CAGGA_", "1150": "CAGGT_", "1151": "CAGGG_", "1152": "CAGGC_", "1153": "CAGCA_", "1154": "CAGCT_", "1155": "CAGCG_", "1156": "CAGCC_", "1157": "CACAA_", "1158": "CACAT_", "1159": "CACAG_", "1160": "CACAC_", "1161": "CACTA_", "1162": "CACTT_", "1163": "CACTG_", "1164": "CACTC_", "1165": "CACGA_", "1166": "CACGT_", "1167": "CACGG_", "1168": "CACGC_", "1169": "CACCA_", "1170": "CACCT_", "1171": "CACCG_", "1172": "CACCC_", "1173": "CTAAA_", "1174": "CTAAT_", "1175": "CTAAG_", "1176": "CTAAC_", "1177": "CTATA_", "1178": "CTATT_", "1179": "CTATG_", "1180": "CTATC_", "1181": "CTAGA_", "1182": "CTAGT_", "1183": "CTAGG_", "1184": "CTAGC_", "1185": "CTACA_", "1186": "CTACT_", "1187": "CTACG_", "1188": "CTACC_", "1189": "CTTAA_", "1190": "CTTAT_", "1191": "CTTAG_", "1192": "CTTAC_", "1193": "CTTTA_", "1194": "CTTTT_", "1195": "CTTTG_", "1196": "CTTTC_", "1197": "CTTGA_", "1198": "CTTGT_", "1199": "CTTGG_", "1200": "CTTGC_", "1201": "CTTCA_", "1202": "CTTCT_", "1203": "CTTCG_", "1204": "CTTCC_", "1205": "CTGAA_", "1206": "CTGAT_", "1207": "CTGAG_", "1208": "CTGAC_", "1209": "CTGTA_", "1210": "CTGTT_", "1211": "CTGTG_", "1212": "CTGTC_", "1213": "CTGGA_", "1214": "CTGGT_", "1215": "CTGGG_", "1216": "CTGGC_", "1217": "CTGCA_", "1218": "CTGCT_", "1219": "CTGCG_", "1220": "CTGCC_", "1221": "CTCAA_", "1222": "CTCAT_", "1223": "CTCAG_", "1224": "CTCAC_", "1225": "CTCTA_", "1226": "CTCTT_", "1227": "CTCTG_", "1228": "CTCTC_", "1229": "CTCGA_", "1230": "CTCGT_", "1231": "CTCGG_", "1232": "CTCGC_", "1233": "CTCCA_", "1234": "CTCCT_", "1235": "CTCCG_", "1236": "CTCCC_", "1237": "CGAAA_", "1238": "CGAAT_", "1239": "CGAAG_", "1240": "CGAAC_", "1241": "CGATA_", "1242": "CGATT_", "1243": "CGATG_", "1244": "CGATC_", "1245": "CGAGA_", "1246": "CGAGT_", "1247": "CGAGG_", "1248": "CGAGC_", "1249": "CGACA_", "1250": "CGACT_", "1251": "CGACG_", "1252": "CGACC_", "1253": "CGTAA_", "1254": "CGTAT_", "1255": "CGTAG_", "1256": "CGTAC_", "1257": "CGTTA_", "1258": "CGTTT_", "1259": "CGTTG_", "1260": "CGTTC_", "1261": "CGTGA_", "1262": "CGTGT_", "1263": "CGTGG_", "1264": "CGTGC_", "1265": "CGTCA_", "1266": "CGTCT_", "1267": "CGTCG_", "1268": "CGTCC_", "1269": "CGGAA_", "1270": "CGGAT_", "1271": "CGGAG_", "1272": "CGGAC_", "1273": "CGGTA_", "1274": "CGGTT_", "1275": "CGGTG_", "1276": "CGGTC_", "1277": "CGGGA_", "1278": "CGGGT_", "1279": "CGGGG_", "1280": "CGGGC_", "1281": "CGGCA_", "1282": "CGGCT_", "1283": "CGGCG_", "1284": "CGGCC_", "1285": "CGCAA_", "1286": "CGCAT_", "1287": "CGCAG_", "1288": "CGCAC_", "1289": "CGCTA_", "1290": "CGCTT_", "1291": "CGCTG_", "1292": "CGCTC_", "1293": "CGCGA_", "1294": "CGCGT_", "1295": "CGCGG_", "1296": "CGCGC_", "1297": "CGCCA_", "1298": "CGCCT_", "1299": "CGCCG_", "1300": "CGCCC_", "1301": "CCAAA_", "1302": "CCAAT_", "1303": "CCAAG_", "1304": "CCAAC_", "1305": "CCATA_", "1306": "CCATT_", "1307": "CCATG_", "1308": "CCATC_", "1309": "CCAGA_", "1310": "CCAGT_", "1311": "CCAGG_", "1312": "CCAGC_", "1313": "CCACA_", "1314": "CCACT_", "1315": "CCACG_", "1316": "CCACC_", "1317": "CCTAA_", "1318": "CCTAT_", "1319": "CCTAG_", "1320": "CCTAC_", "1321": "CCTTA_", "1322": "CCTTT_", "1323": "CCTTG_", "1324": "CCTTC_", "1325": "CCTGA_", "1326": "CCTGT_", "1327": "CCTGG_", "1328": "CCTGC_", "1329": "CCTCA_", "1330": "CCTCT_", "1331": "CCTCG_", "1332": "CCTCC_", "1333": "CCGAA_", "1334": "CCGAT_", "1335": "CCGAG_", "1336": "CCGAC_", "1337": "CCGTA_", "1338": "CCGTT_", "1339": "CCGTG_", "1340": "CCGTC_", "1341": "CCGGA_", "1342": "CCGGT_", "1343": "CCGGG_", "1344": "CCGGC_", "1345": "CCGCA_", "1346": "CCGCT_", "1347": "CCGCG_", "1348": "CCGCC_", "1349": "CCCAA_", "1350": "CCCAT_", "1351": "CCCAG_", "1352": "CCCAC_", "1353": "CCCTA_", "1354": "CCCTT_", "1355": "CCCTG_", "1356": "CCCTC_", "1357": "CCCGA_", "1358": "CCCGT_", "1359": "CCCGG_", "1360": "CCCGC_", "1361": "CCCCA_", "1362": "CCCCT_", "1363": "CCCCG_", "1364": "CCCCC_", "1365": "AAAAAA", "1366": "AAAAAT", "1367": "AAAAAG", "1368": "AAAAAC", "1369": "AAAATA", "1370": "AAAATT", "1371": "AAAATG", "1372": "AAAATC", "1373": "AAAAGA", "1374": "AAAAGT", "1375": "AAAAGG", "1376": "AAAAGC", "1377": "AAAACA", "1378": "AAAACT", "1379": "AAAACG", "1380": "AAAACC", "1381": "AAATAA", "1382": "AAATAT", "1383": "AAATAG", "1384": "AAATAC", "1385": "AAATTA", "1386": "AAATTT", "1387": "AAATTG", "1388": "AAATTC", "1389": "AAATGA", "1390": "AAATGT", "1391": "AAATGG", "1392": "AAATGC", "1393": "AAATCA", "1394": "AAATCT", "1395": "AAATCG", "1396": "AAATCC", "1397": "AAAGAA", "1398": "AAAGAT", "1399": "AAAGAG", "1400": "AAAGAC", "1401": "AAAGTA", "1402": "AAAGTT", "1403": "AAAGTG", "1404": "AAAGTC", "1405": "AAAGGA", "1406": "AAAGGT", "1407": "AAAGGG", "1408": "AAAGGC", "1409": "AAAGCA", "1410": "AAAGCT", "1411": "AAAGCG", "1412": "AAAGCC", "1413": "AAACAA", "1414": "AAACAT", "1415": "AAACAG", "1416": "AAACAC", "1417": "AAACTA", "1418": "AAACTT", "1419": "AAACTG", "1420": "AAACTC", "1421": "AAACGA", "1422": "AAACGT", "1423": "AAACGG", "1424": "AAACGC", "1425": "AAACCA", "1426": "AAACCT", "1427": "AAACCG", "1428": "AAACCC", "1429": "AATAAA", "1430": "AATAAT", "1431": "AATAAG", "1432": "AATAAC", "1433": "AATATA", "1434": "AATATT", "1435": "AATATG", "1436": "AATATC", "1437": "AATAGA", "1438": "AATAGT", "1439": "AATAGG", "1440": "AATAGC", "1441": "AATACA", "1442": "AATACT", "1443": "AATACG", "1444": "AATACC", "1445": "AATTAA", "1446": "AATTAT", "1447": "AATTAG", "1448": "AATTAC", "1449": "AATTTA", "1450": "AATTTT", "1451": "AATTTG", "1452": "AATTTC", "1453": "AATTGA", "1454": "AATTGT", "1455": "AATTGG", "1456": "AATTGC", "1457": "AATTCA", "1458": "AATTCT", "1459": "AATTCG", "1460": "AATTCC", "1461": "AATGAA", "1462": "AATGAT", "1463": "AATGAG", "1464": "AATGAC", "1465": "AATGTA", "1466": "AATGTT", "1467": "AATGTG", "1468": "AATGTC", "1469": "AATGGA", "1470": "AATGGT", "1471": "AATGGG", "1472": "AATGGC", "1473": "AATGCA", "1474": "AATGCT", "1475": "AATGCG", "1476": "AATGCC", "1477": "AATCAA", "1478": "AATCAT", "1479": "AATCAG", "1480": "AATCAC", "1481": "AATCTA", "1482": "AATCTT", "1483": "AATCTG", "1484": "AATCTC", "1485": "AATCGA", "1486": "AATCGT", "1487": "AATCGG", "1488": "AATCGC", "1489": "AATCCA", "1490": "AATCCT", "1491": "AATCCG", "1492": "AATCCC", "1493": "AAGAAA", "1494": "AAGAAT", "1495": "AAGAAG", "1496": "AAGAAC", "1497": "AAGATA", "1498": "AAGATT", "1499": "AAGATG", "1500": "AAGATC", "1501": "AAGAGA", "1502": "AAGAGT", "1503": "AAGAGG", "1504": "AAGAGC", "1505": "AAGACA", "1506": "AAGACT", "1507": "AAGACG", "1508": "AAGACC", "1509": "AAGTAA", "1510": "AAGTAT", "1511": "AAGTAG", "1512": "AAGTAC", "1513": "AAGTTA", "1514": "AAGTTT", "1515": "AAGTTG", "1516": "AAGTTC", "1517": "AAGTGA", "1518": "AAGTGT", "1519": "AAGTGG", "1520": "AAGTGC", "1521": "AAGTCA", "1522": "AAGTCT", "1523": "AAGTCG", "1524": "AAGTCC", "1525": "AAGGAA", "1526": "AAGGAT", "1527": "AAGGAG", "1528": "AAGGAC", "1529": "AAGGTA", "1530": "AAGGTT", "1531": "AAGGTG", "1532": "AAGGTC", "1533": "AAGGGA", "1534": "AAGGGT", "1535": "AAGGGG", "1536": "AAGGGC", "1537": "AAGGCA", "1538": "AAGGCT", "1539": "AAGGCG", "1540": "AAGGCC", "1541": "AAGCAA", "1542": "AAGCAT", "1543": "AAGCAG", "1544": "AAGCAC", "1545": "AAGCTA", "1546": "AAGCTT", "1547": "AAGCTG", "1548": "AAGCTC", "1549": "AAGCGA", "1550": "AAGCGT", "1551": "AAGCGG", "1552": "AAGCGC", "1553": "AAGCCA", "1554": "AAGCCT", "1555": "AAGCCG", "1556": "AAGCCC", "1557": "AACAAA", "1558": "AACAAT", "1559": "AACAAG", "1560": "AACAAC", "1561": "AACATA", "1562": "AACATT", "1563": "AACATG", "1564": "AACATC", "1565": "AACAGA", "1566": "AACAGT", "1567": "AACAGG", "1568": "AACAGC", "1569": "AACACA", "1570": "AACACT", "1571": "AACACG", "1572": "AACACC", "1573": "AACTAA", "1574": "AACTAT", "1575": "AACTAG", "1576": "AACTAC", "1577": "AACTTA", "1578": "AACTTT", "1579": "AACTTG", "1580": "AACTTC", "1581": "AACTGA", "1582": "AACTGT", "1583": "AACTGG", "1584": "AACTGC", "1585": "AACTCA", "1586": "AACTCT", "1587": "AACTCG", "1588": "AACTCC", "1589": "AACGAA", "1590": "AACGAT", "1591": "AACGAG", "1592": "AACGAC", "1593": "AACGTA", "1594": "AACGTT", "1595": "AACGTG", "1596": "AACGTC", "1597": "AACGGA", "1598": "AACGGT", "1599": "AACGGG", "1600": "AACGGC", "1601": "AACGCA", "1602": "AACGCT", "1603": "AACGCG", "1604": "AACGCC", "1605": "AACCAA", "1606": "AACCAT", "1607": "AACCAG", "1608": "AACCAC", "1609": "AACCTA", "1610": "AACCTT", "1611": "AACCTG", "1612": "AACCTC", "1613": "AACCGA", "1614": "AACCGT", "1615": "AACCGG", "1616": "AACCGC", "1617": "AACCCA", "1618": "AACCCT", "1619": "AACCCG", "1620": "AACCCC", "1621": "ATAAAA", "1622": "ATAAAT", "1623": "ATAAAG", "1624": "ATAAAC", "1625": "ATAATA", "1626": "ATAATT", "1627": "ATAATG", "1628": "ATAATC", "1629": "ATAAGA", "1630": "ATAAGT", "1631": "ATAAGG", "1632": "ATAAGC", "1633": "ATAACA", "1634": "ATAACT", "1635": "ATAACG", "1636": "ATAACC", "1637": "ATATAA", "1638": "ATATAT", "1639": "ATATAG", "1640": "ATATAC", "1641": "ATATTA", "1642": "ATATTT", "1643": "ATATTG", "1644": "ATATTC", "1645": "ATATGA", "1646": "ATATGT", "1647": "ATATGG", "1648": "ATATGC", "1649": "ATATCA", "1650": "ATATCT", "1651": "ATATCG", "1652": "ATATCC", "1653": "ATAGAA", "1654": "ATAGAT", "1655": "ATAGAG", "1656": "ATAGAC", "1657": "ATAGTA", "1658": "ATAGTT", "1659": "ATAGTG", "1660": "ATAGTC", "1661": "ATAGGA", "1662": "ATAGGT", "1663": "ATAGGG", "1664": "ATAGGC", "1665": "ATAGCA", "1666": "ATAGCT", "1667": "ATAGCG", "1668": "ATAGCC", "1669": "ATACAA", "1670": "ATACAT", "1671": "ATACAG", "1672": "ATACAC", "1673": "ATACTA", "1674": "ATACTT", "1675": "ATACTG", "1676": "ATACTC", "1677": "ATACGA", "1678": "ATACGT", "1679": "ATACGG", "1680": "ATACGC", "1681": "ATACCA", "1682": "ATACCT", "1683": "ATACCG", "1684": "ATACCC", "1685": "ATTAAA", "1686": "ATTAAT", "1687": "ATTAAG", "1688": "ATTAAC", "1689": "ATTATA", "1690": "ATTATT", "1691": "ATTATG", "1692": "ATTATC", "1693": "ATTAGA", "1694": "ATTAGT", "1695": "ATTAGG", "1696": "ATTAGC", "1697": "ATTACA", "1698": "ATTACT", "1699": "ATTACG", "1700": "ATTACC", "1701": "ATTTAA", "1702": "ATTTAT", "1703": "ATTTAG", "1704": "ATTTAC", "1705": "ATTTTA", "1706": "ATTTTT", "1707": "ATTTTG", "1708": "ATTTTC", "1709": "ATTTGA", "1710": "ATTTGT", "1711": "ATTTGG", "1712": "ATTTGC", "1713": "ATTTCA", "1714": "ATTTCT", "1715": "ATTTCG", "1716": "ATTTCC", "1717": "ATTGAA", "1718": "ATTGAT", "1719": "ATTGAG", "1720": "ATTGAC", "1721": "ATTGTA", "1722": "ATTGTT", "1723": "ATTGTG", "1724": "ATTGTC", "1725": "ATTGGA", "1726": "ATTGGT", "1727": "ATTGGG", "1728": "ATTGGC", "1729": "ATTGCA", "1730": "ATTGCT", "1731": "ATTGCG", "1732": "ATTGCC", "1733": "ATTCAA", "1734": "ATTCAT", "1735": "ATTCAG", "1736": "ATTCAC", "1737": "ATTCTA", "1738": "ATTCTT", "1739": "ATTCTG", "1740": "ATTCTC", "1741": "ATTCGA", "1742": "ATTCGT", "1743": "ATTCGG", "1744": "ATTCGC", "1745": "ATTCCA", "1746": "ATTCCT", "1747": "ATTCCG", "1748": "ATTCCC", "1749": "ATGAAA", "1750": "ATGAAT", "1751": "ATGAAG", "1752": "ATGAAC", "1753": "ATGATA", "1754": "ATGATT", "1755": "ATGATG", "1756": "ATGATC", "1757": "ATGAGA", "1758": "ATGAGT", "1759": "ATGAGG", "1760": "ATGAGC", "1761": "ATGACA", "1762": "ATGACT", "1763": "ATGACG", "1764": "ATGACC", "1765": "ATGTAA", "1766": "ATGTAT", "1767": "ATGTAG", "1768": "ATGTAC", "1769": "ATGTTA", "1770": "ATGTTT", "1771": "ATGTTG", "1772": "ATGTTC", "1773": "ATGTGA", "1774": "ATGTGT", "1775": "ATGTGG", "1776": "ATGTGC", "1777": "ATGTCA", "1778": "ATGTCT", "1779": "ATGTCG", "1780": "ATGTCC", "1781": "ATGGAA", "1782": "ATGGAT", "1783": "ATGGAG", "1784": "ATGGAC", "1785": "ATGGTA", "1786": "ATGGTT", "1787": "ATGGTG", "1788": "ATGGTC", "1789": "ATGGGA", "1790": "ATGGGT", "1791": "ATGGGG", "1792": "ATGGGC", "1793": "ATGGCA", "1794": "ATGGCT", "1795": "ATGGCG", "1796": "ATGGCC", "1797": "ATGCAA", "1798": "ATGCAT", "1799": "ATGCAG", "1800": "ATGCAC", "1801": "ATGCTA", "1802": "ATGCTT", "1803": "ATGCTG", "1804": "ATGCTC", "1805": "ATGCGA", "1806": "ATGCGT", "1807": "ATGCGG", "1808": "ATGCGC", "1809": "ATGCCA", "1810": "ATGCCT", "1811": "ATGCCG", "1812": "ATGCCC", "1813": "ATCAAA", "1814": "ATCAAT", "1815": "ATCAAG", "1816": "ATCAAC", "1817": "ATCATA", "1818": "ATCATT", "1819": "ATCATG", "1820": "ATCATC", "1821": "ATCAGA", "1822": "ATCAGT", "1823": "ATCAGG", "1824": "ATCAGC", "1825": "ATCACA", "1826": "ATCACT", "1827": "ATCACG", "1828": "ATCACC", "1829": "ATCTAA", "1830": "ATCTAT", "1831": "ATCTAG", "1832": "ATCTAC", "1833": "ATCTTA", "1834": "ATCTTT", "1835": "ATCTTG", "1836": "ATCTTC", "1837": "ATCTGA", "1838": "ATCTGT", "1839": "ATCTGG", "1840": "ATCTGC", "1841": "ATCTCA", "1842": "ATCTCT", "1843": "ATCTCG", "1844": "ATCTCC", "1845": "ATCGAA", "1846": "ATCGAT", "1847": "ATCGAG", "1848": "ATCGAC", "1849": "ATCGTA", "1850": "ATCGTT", "1851": "ATCGTG", "1852": "ATCGTC", "1853": "ATCGGA", "1854": "ATCGGT", "1855": "ATCGGG", "1856": "ATCGGC", "1857": "ATCGCA", "1858": "ATCGCT", "1859": "ATCGCG", "1860": "ATCGCC", "1861": "ATCCAA", "1862": "ATCCAT", "1863": "ATCCAG", "1864": "ATCCAC", "1865": "ATCCTA", "1866": "ATCCTT", "1867": "ATCCTG", "1868": "ATCCTC", "1869": "ATCCGA", "1870": "ATCCGT", "1871": "ATCCGG", "1872": "ATCCGC", "1873": "ATCCCA", "1874": "ATCCCT", "1875": "ATCCCG", "1876": "ATCCCC", "1877": "AGAAAA", "1878": "AGAAAT", "1879": "AGAAAG", "1880": "AGAAAC", "1881": "AGAATA", "1882": "AGAATT", "1883": "AGAATG", "1884": "AGAATC", "1885": "AGAAGA", "1886": "AGAAGT", "1887": "AGAAGG", "1888": "AGAAGC", "1889": "AGAACA", "1890": "AGAACT", "1891": "AGAACG", "1892": "AGAACC", "1893": "AGATAA", "1894": "AGATAT", "1895": "AGATAG", "1896": "AGATAC", "1897": "AGATTA", "1898": "AGATTT", "1899": "AGATTG", "1900": "AGATTC", "1901": "AGATGA", "1902": "AGATGT", "1903": "AGATGG", "1904": "AGATGC", "1905": "AGATCA", "1906": "AGATCT", "1907": "AGATCG", "1908": "AGATCC", "1909": "AGAGAA", "1910": "AGAGAT", "1911": "AGAGAG", "1912": "AGAGAC", "1913": "AGAGTA", "1914": "AGAGTT", "1915": "AGAGTG", "1916": "AGAGTC", "1917": "AGAGGA", "1918": "AGAGGT", "1919": "AGAGGG", "1920": "AGAGGC", "1921": "AGAGCA", "1922": "AGAGCT", "1923": "AGAGCG", "1924": "AGAGCC", "1925": "AGACAA", "1926": "AGACAT", "1927": "AGACAG", "1928": "AGACAC", "1929": "AGACTA", "1930": "AGACTT", "1931": "AGACTG", "1932": "AGACTC", "1933": "AGACGA", "1934": "AGACGT", "1935": "AGACGG", "1936": "AGACGC", "1937": "AGACCA", "1938": "AGACCT", "1939": "AGACCG", "1940": "AGACCC", "1941": "AGTAAA", "1942": "AGTAAT", "1943": "AGTAAG", "1944": "AGTAAC", "1945": "AGTATA", "1946": "AGTATT", "1947": "AGTATG", "1948": "AGTATC", "1949": "AGTAGA", "1950": "AGTAGT", "1951": "AGTAGG", "1952": "AGTAGC", "1953": "AGTACA", "1954": "AGTACT", "1955": "AGTACG", "1956": "AGTACC", "1957": "AGTTAA", "1958": "AGTTAT", "1959": "AGTTAG", "1960": "AGTTAC", "1961": "AGTTTA", "1962": "AGTTTT", "1963": "AGTTTG", "1964": "AGTTTC", "1965": "AGTTGA", "1966": "AGTTGT", "1967": "AGTTGG", "1968": "AGTTGC", "1969": "AGTTCA", "1970": "AGTTCT", "1971": "AGTTCG", "1972": "AGTTCC", "1973": "AGTGAA", "1974": "AGTGAT", "1975": "AGTGAG", "1976": "AGTGAC", "1977": "AGTGTA", "1978": "AGTGTT", "1979": "AGTGTG", "1980": "AGTGTC", "1981": "AGTGGA", "1982": "AGTGGT", "1983": "AGTGGG", "1984": "AGTGGC", "1985": "AGTGCA", "1986": "AGTGCT", "1987": "AGTGCG", "1988": "AGTGCC", "1989": "AGTCAA", "1990": "AGTCAT", "1991": "AGTCAG", "1992": "AGTCAC", "1993": "AGTCTA", "1994": "AGTCTT", "1995": "AGTCTG", "1996": "AGTCTC", "1997": "AGTCGA", "1998": "AGTCGT", "1999": "AGTCGG", "2000": "AGTCGC", "2001": "AGTCCA", "2002": "AGTCCT", "2003": "AGTCCG", "2004": "AGTCCC", "2005": "AGGAAA", "2006": "AGGAAT", "2007": "AGGAAG", "2008": "AGGAAC", "2009": "AGGATA", "2010": "AGGATT", "2011": "AGGATG", "2012": "AGGATC", "2013": "AGGAGA", "2014": "AGGAGT", "2015": "AGGAGG", "2016": "AGGAGC", "2017": "AGGACA", "2018": "AGGACT", "2019": "AGGACG", "2020": "AGGACC", "2021": "AGGTAA", "2022": "AGGTAT", "2023": "AGGTAG", "2024": "AGGTAC", "2025": "AGGTTA", "2026": "AGGTTT", "2027": "AGGTTG", "2028": "AGGTTC", "2029": "AGGTGA", "2030": "AGGTGT", "2031": "AGGTGG", "2032": "AGGTGC", "2033": "AGGTCA", "2034": "AGGTCT", "2035": "AGGTCG", "2036": "AGGTCC", "2037": "AGGGAA", "2038": "AGGGAT", "2039": "AGGGAG", "2040": "AGGGAC", "2041": "AGGGTA", "2042": "AGGGTT", "2043": "AGGGTG", "2044": "AGGGTC", "2045": "AGGGGA", "2046": "AGGGGT", "2047": "AGGGGG", "2048": "AGGGGC", "2049": "AGGGCA", "2050": "AGGGCT", "2051": "AGGGCG", "2052": "AGGGCC", "2053": "AGGCAA", "2054": "AGGCAT", "2055": "AGGCAG", "2056": "AGGCAC", "2057": "AGGCTA", "2058": "AGGCTT", "2059": "AGGCTG", "2060": "AGGCTC", "2061": "AGGCGA", "2062": "AGGCGT", "2063": "AGGCGG", "2064": "AGGCGC", "2065": "AGGCCA", "2066": "AGGCCT", "2067": "AGGCCG", "2068": "AGGCCC", "2069": "AGCAAA", "2070": "AGCAAT", "2071": "AGCAAG", "2072": "AGCAAC", "2073": "AGCATA", "2074": "AGCATT", "2075": "AGCATG", "2076": "AGCATC", "2077": "AGCAGA", "2078": "AGCAGT", "2079": "AGCAGG", "2080": "AGCAGC", "2081": "AGCACA", "2082": "AGCACT", "2083": "AGCACG", "2084": "AGCACC", "2085": "AGCTAA", "2086": "AGCTAT", "2087": "AGCTAG", "2088": "AGCTAC", "2089": "AGCTTA", "2090": "AGCTTT", "2091": "AGCTTG", "2092": "AGCTTC", "2093": "AGCTGA", "2094": "AGCTGT", "2095": "AGCTGG", "2096": "AGCTGC", "2097": "AGCTCA", "2098": "AGCTCT", "2099": "AGCTCG", "2100": "AGCTCC", "2101": "AGCGAA", "2102": "AGCGAT", "2103": "AGCGAG", "2104": "AGCGAC", "2105": "AGCGTA", "2106": "AGCGTT", "2107": "AGCGTG", "2108": "AGCGTC", "2109": "AGCGGA", "2110": "AGCGGT", "2111": "AGCGGG", "2112": "AGCGGC", "2113": "AGCGCA", "2114": "AGCGCT", "2115": "AGCGCG", "2116": "AGCGCC", "2117": "AGCCAA", "2118": "AGCCAT", "2119": "AGCCAG", "2120": "AGCCAC", "2121": "AGCCTA", "2122": "AGCCTT", "2123": "AGCCTG", "2124": "AGCCTC", "2125": "AGCCGA", "2126": "AGCCGT", "2127": "AGCCGG", "2128": "AGCCGC", "2129": "AGCCCA", "2130": "AGCCCT", "2131": "AGCCCG", "2132": "AGCCCC", "2133": "ACAAAA", "2134": "ACAAAT", "2135": "ACAAAG", "2136": "ACAAAC", "2137": "ACAATA", "2138": "ACAATT", "2139": "ACAATG", "2140": "ACAATC", "2141": "ACAAGA", "2142": "ACAAGT", "2143": "ACAAGG", "2144": "ACAAGC", "2145": "ACAACA", "2146": "ACAACT", "2147": "ACAACG", "2148": "ACAACC", "2149": "ACATAA", "2150": "ACATAT", "2151": "ACATAG", "2152": "ACATAC", "2153": "ACATTA", "2154": "ACATTT", "2155": "ACATTG", "2156": "ACATTC", "2157": "ACATGA", "2158": "ACATGT", "2159": "ACATGG", "2160": "ACATGC", "2161": "ACATCA", "2162": "ACATCT", "2163": "ACATCG", "2164": "ACATCC", "2165": "ACAGAA", "2166": "ACAGAT", "2167": "ACAGAG", "2168": "ACAGAC", "2169": "ACAGTA", "2170": "ACAGTT", "2171": "ACAGTG", "2172": "ACAGTC", "2173": "ACAGGA", "2174": "ACAGGT", "2175": "ACAGGG", "2176": "ACAGGC", "2177": "ACAGCA", "2178": "ACAGCT", "2179": "ACAGCG", "2180": "ACAGCC", "2181": "ACACAA", "2182": "ACACAT", "2183": "ACACAG", "2184": "ACACAC", "2185": "ACACTA", "2186": "ACACTT", "2187": "ACACTG", "2188": "ACACTC", "2189": "ACACGA", "2190": "ACACGT", "2191": "ACACGG", "2192": "ACACGC", "2193": "ACACCA", "2194": "ACACCT", "2195": "ACACCG", "2196": "ACACCC", "2197": "ACTAAA", "2198": "ACTAAT", "2199": "ACTAAG", "2200": "ACTAAC", "2201": "ACTATA", "2202": "ACTATT", "2203": "ACTATG", "2204": "ACTATC", "2205": "ACTAGA", "2206": "ACTAGT", "2207": "ACTAGG", "2208": "ACTAGC", "2209": "ACTACA", "2210": "ACTACT", "2211": "ACTACG", "2212": "ACTACC", "2213": "ACTTAA", "2214": "ACTTAT", "2215": "ACTTAG", "2216": "ACTTAC", "2217": "ACTTTA", "2218": "ACTTTT", "2219": "ACTTTG", "2220": "ACTTTC", "2221": "ACTTGA", "2222": "ACTTGT", "2223": "ACTTGG", "2224": "ACTTGC", "2225": "ACTTCA", "2226": "ACTTCT", "2227": "ACTTCG", "2228": "ACTTCC", "2229": "ACTGAA", "2230": "ACTGAT", "2231": "ACTGAG", "2232": "ACTGAC", "2233": "ACTGTA", "2234": "ACTGTT", "2235": "ACTGTG", "2236": "ACTGTC", "2237": "ACTGGA", "2238": "ACTGGT", "2239": "ACTGGG", "2240": "ACTGGC", "2241": "ACTGCA", "2242": "ACTGCT", "2243": "ACTGCG", "2244": "ACTGCC", "2245": "ACTCAA", "2246": "ACTCAT", "2247": "ACTCAG", "2248": "ACTCAC", "2249": "ACTCTA", "2250": "ACTCTT", "2251": "ACTCTG", "2252": "ACTCTC", "2253": "ACTCGA", "2254": "ACTCGT", "2255": "ACTCGG", "2256": "ACTCGC", "2257": "ACTCCA", "2258": "ACTCCT", "2259": "ACTCCG", "2260": "ACTCCC", "2261": "ACGAAA", "2262": "ACGAAT", "2263": "ACGAAG", "2264": "ACGAAC", "2265": "ACGATA", "2266": "ACGATT", "2267": "ACGATG", "2268": "ACGATC", "2269": "ACGAGA", "2270": "ACGAGT", "2271": "ACGAGG", "2272": "ACGAGC", "2273": "ACGACA", "2274": "ACGACT", "2275": "ACGACG", "2276": "ACGACC", "2277": "ACGTAA", "2278": "ACGTAT", "2279": "ACGTAG", "2280": "ACGTAC", "2281": "ACGTTA", "2282": "ACGTTT", "2283": "ACGTTG", "2284": "ACGTTC", "2285": "ACGTGA", "2286": "ACGTGT", "2287": "ACGTGG", "2288": "ACGTGC", "2289": "ACGTCA", "2290": "ACGTCT", "2291": "ACGTCG", "2292": "ACGTCC", "2293": "ACGGAA", "2294": "ACGGAT", "2295": "ACGGAG", "2296": "ACGGAC", "2297": "ACGGTA", "2298": "ACGGTT", "2299": "ACGGTG", "2300": "ACGGTC", "2301": "ACGGGA", "2302": "ACGGGT", "2303": "ACGGGG", "2304": "ACGGGC", "2305": "ACGGCA", "2306": "ACGGCT", "2307": "ACGGCG", "2308": "ACGGCC", "2309": "ACGCAA", "2310": "ACGCAT", "2311": "ACGCAG", "2312": "ACGCAC", "2313": "ACGCTA", "2314": "ACGCTT", "2315": "ACGCTG", "2316": "ACGCTC", "2317": "ACGCGA", "2318": "ACGCGT", "2319": "ACGCGG", "2320": "ACGCGC", "2321": "ACGCCA", "2322": "ACGCCT", "2323": "ACGCCG", "2324": "ACGCCC", "2325": "ACCAAA", "2326": "ACCAAT", "2327": "ACCAAG", "2328": "ACCAAC", "2329": "ACCATA", "2330": "ACCATT", "2331": "ACCATG", "2332": "ACCATC", "2333": "ACCAGA", "2334": "ACCAGT", "2335": "ACCAGG", "2336": "ACCAGC", "2337": "ACCACA", "2338": "ACCACT", "2339": "ACCACG", "2340": "ACCACC", "2341": "ACCTAA", "2342": "ACCTAT", "2343": "ACCTAG", "2344": "ACCTAC", "2345": "ACCTTA", "2346": "ACCTTT", "2347": "ACCTTG", "2348": "ACCTTC", "2349": "ACCTGA", "2350": "ACCTGT", "2351": "ACCTGG", "2352": "ACCTGC", "2353": "ACCTCA", "2354": "ACCTCT", "2355": "ACCTCG", "2356": "ACCTCC", "2357": "ACCGAA", "2358": "ACCGAT", "2359": "ACCGAG", "2360": "ACCGAC", "2361": "ACCGTA", "2362": "ACCGTT", "2363": "ACCGTG", "2364": "ACCGTC", "2365": "ACCGGA", "2366": "ACCGGT", "2367": "ACCGGG", "2368": "ACCGGC", "2369": "ACCGCA", "2370": "ACCGCT", "2371": "ACCGCG", "2372": "ACCGCC", "2373": "ACCCAA", "2374": "ACCCAT", "2375": "ACCCAG", "2376": "ACCCAC", "2377": "ACCCTA", "2378": "ACCCTT", "2379": "ACCCTG", "2380": "ACCCTC", "2381": "ACCCGA", "2382": "ACCCGT", "2383": "ACCCGG", "2384": "ACCCGC", "2385": "ACCCCA", "2386": "ACCCCT", "2387": "ACCCCG", "2388": "ACCCCC", "2389": "TAAAAA", "2390": "TAAAAT", "2391": "TAAAAG", "2392": "TAAAAC", "2393": "TAAATA", "2394": "TAAATT", "2395": "TAAATG", "2396": "TAAATC", "2397": "TAAAGA", "2398": "TAAAGT", "2399": "TAAAGG", "2400": "TAAAGC", "2401": "TAAACA", "2402": "TAAACT", "2403": "TAAACG", "2404": "TAAACC", "2405": "TAATAA", "2406": "TAATAT", "2407": "TAATAG", "2408": "TAATAC", "2409": "TAATTA", "2410": "TAATTT", "2411": "TAATTG", "2412": "TAATTC", "2413": "TAATGA", "2414": "TAATGT", "2415": "TAATGG", "2416": "TAATGC", "2417": "TAATCA", "2418": "TAATCT", "2419": "TAATCG", "2420": "TAATCC", "2421": "TAAGAA", "2422": "TAAGAT", "2423": "TAAGAG", "2424": "TAAGAC", "2425": "TAAGTA", "2426": "TAAGTT", "2427": "TAAGTG", "2428": "TAAGTC", "2429": "TAAGGA", "2430": "TAAGGT", "2431": "TAAGGG", "2432": "TAAGGC", "2433": "TAAGCA", "2434": "TAAGCT", "2435": "TAAGCG", "2436": "TAAGCC", "2437": "TAACAA", "2438": "TAACAT", "2439": "TAACAG", "2440": "TAACAC", "2441": "TAACTA", "2442": "TAACTT", "2443": "TAACTG", "2444": "TAACTC", "2445": "TAACGA", "2446": "TAACGT", "2447": "TAACGG", "2448": "TAACGC", "2449": "TAACCA", "2450": "TAACCT", "2451": "TAACCG", "2452": "TAACCC", "2453": "TATAAA", "2454": "TATAAT", "2455": "TATAAG", "2456": "TATAAC", "2457": "TATATA", "2458": "TATATT", "2459": "TATATG", "2460": "TATATC", "2461": "TATAGA", "2462": "TATAGT", "2463": "TATAGG", "2464": "TATAGC", "2465": "TATACA", "2466": "TATACT", "2467": "TATACG", "2468": "TATACC", "2469": "TATTAA", "2470": "TATTAT", "2471": "TATTAG", "2472": "TATTAC", "2473": "TATTTA", "2474": "TATTTT", "2475": "TATTTG", "2476": "TATTTC", "2477": "TATTGA", "2478": "TATTGT", "2479": "TATTGG", "2480": "TATTGC", "2481": "TATTCA", "2482": "TATTCT", "2483": "TATTCG", "2484": "TATTCC", "2485": "TATGAA", "2486": "TATGAT", "2487": "TATGAG", "2488": "TATGAC", "2489": "TATGTA", "2490": "TATGTT", "2491": "TATGTG", "2492": "TATGTC", "2493": "TATGGA", "2494": "TATGGT", "2495": "TATGGG", "2496": "TATGGC", "2497": "TATGCA", "2498": "TATGCT", "2499": "TATGCG", "2500": "TATGCC", "2501": "TATCAA", "2502": "TATCAT", "2503": "TATCAG", "2504": "TATCAC", "2505": "TATCTA", "2506": "TATCTT", "2507": "TATCTG", "2508": "TATCTC", "2509": "TATCGA", "2510": "TATCGT", "2511": "TATCGG", "2512": "TATCGC", "2513": "TATCCA", "2514": "TATCCT", "2515": "TATCCG", "2516": "TATCCC", "2517": "TAGAAA", "2518": "TAGAAT", "2519": "TAGAAG", "2520": "TAGAAC", "2521": "TAGATA", "2522": "TAGATT", "2523": "TAGATG", "2524": "TAGATC", "2525": "TAGAGA", "2526": "TAGAGT", "2527": "TAGAGG", "2528": "TAGAGC", "2529": "TAGACA", "2530": "TAGACT", "2531": "TAGACG", "2532": "TAGACC", "2533": "TAGTAA", "2534": "TAGTAT", "2535": "TAGTAG", "2536": "TAGTAC", "2537": "TAGTTA", "2538": "TAGTTT", "2539": "TAGTTG", "2540": "TAGTTC", "2541": "TAGTGA", "2542": "TAGTGT", "2543": "TAGTGG", "2544": "TAGTGC", "2545": "TAGTCA", "2546": "TAGTCT", "2547": "TAGTCG", "2548": "TAGTCC", "2549": "TAGGAA", "2550": "TAGGAT", "2551": "TAGGAG", "2552": "TAGGAC", "2553": "TAGGTA", "2554": "TAGGTT", "2555": "TAGGTG", "2556": "TAGGTC", "2557": "TAGGGA", "2558": "TAGGGT", "2559": "TAGGGG", "2560": "TAGGGC", "2561": "TAGGCA", "2562": "TAGGCT", "2563": "TAGGCG", "2564": "TAGGCC", "2565": "TAGCAA", "2566": "TAGCAT", "2567": "TAGCAG", "2568": "TAGCAC", "2569": "TAGCTA", "2570": "TAGCTT", "2571": "TAGCTG", "2572": "TAGCTC", "2573": "TAGCGA", "2574": "TAGCGT", "2575": "TAGCGG", "2576": "TAGCGC", "2577": "TAGCCA", "2578": "TAGCCT", "2579": "TAGCCG", "2580": "TAGCCC", "2581": "TACAAA", "2582": "TACAAT", "2583": "TACAAG", "2584": "TACAAC", "2585": "TACATA", "2586": "TACATT", "2587": "TACATG", "2588": "TACATC", "2589": "TACAGA", "2590": "TACAGT", "2591": "TACAGG", "2592": "TACAGC", "2593": "TACACA", "2594": "TACACT", "2595": "TACACG", "2596": "TACACC", "2597": "TACTAA", "2598": "TACTAT", "2599": "TACTAG", "2600": "TACTAC", "2601": "TACTTA", "2602": "TACTTT", "2603": "TACTTG", "2604": "TACTTC", "2605": "TACTGA", "2606": "TACTGT", "2607": "TACTGG", "2608": "TACTGC", "2609": "TACTCA", "2610": "TACTCT", "2611": "TACTCG", "2612": "TACTCC", "2613": "TACGAA", "2614": "TACGAT", "2615": "TACGAG", "2616": "TACGAC", "2617": "TACGTA", "2618": "TACGTT", "2619": "TACGTG", "2620": "TACGTC", "2621": "TACGGA", "2622": "TACGGT", "2623": "TACGGG", "2624": "TACGGC", "2625": "TACGCA", "2626": "TACGCT", "2627": "TACGCG", "2628": "TACGCC", "2629": "TACCAA", "2630": "TACCAT", "2631": "TACCAG", "2632": "TACCAC", "2633": "TACCTA", "2634": "TACCTT", "2635": "TACCTG", "2636": "TACCTC", "2637": "TACCGA", "2638": "TACCGT", "2639": "TACCGG", "2640": "TACCGC", "2641": "TACCCA", "2642": "TACCCT", "2643": "TACCCG", "2644": "TACCCC", "2645": "TTAAAA", "2646": "TTAAAT", "2647": "TTAAAG", "2648": "TTAAAC", "2649": "TTAATA", "2650": "TTAATT", "2651": "TTAATG", "2652": "TTAATC", "2653": "TTAAGA", "2654": "TTAAGT", "2655": "TTAAGG", "2656": "TTAAGC", "2657": "TTAACA", "2658": "TTAACT", "2659": "TTAACG", "2660": "TTAACC", "2661": "TTATAA", "2662": "TTATAT", "2663": "TTATAG", "2664": "TTATAC", "2665": "TTATTA", "2666": "TTATTT", "2667": "TTATTG", "2668": "TTATTC", "2669": "TTATGA", "2670": "TTATGT", "2671": "TTATGG", "2672": "TTATGC", "2673": "TTATCA", "2674": "TTATCT", "2675": "TTATCG", "2676": "TTATCC", "2677": "TTAGAA", "2678": "TTAGAT", "2679": "TTAGAG", "2680": "TTAGAC", "2681": "TTAGTA", "2682": "TTAGTT", "2683": "TTAGTG", "2684": "TTAGTC", "2685": "TTAGGA", "2686": "TTAGGT", "2687": "TTAGGG", "2688": "TTAGGC", "2689": "TTAGCA", "2690": "TTAGCT", "2691": "TTAGCG", "2692": "TTAGCC", "2693": "TTACAA", "2694": "TTACAT", "2695": "TTACAG", "2696": "TTACAC", "2697": "TTACTA", "2698": "TTACTT", "2699": "TTACTG", "2700": "TTACTC", "2701": "TTACGA", "2702": "TTACGT", "2703": "TTACGG", "2704": "TTACGC", "2705": "TTACCA", "2706": "TTACCT", "2707": "TTACCG", "2708": "TTACCC", "2709": "TTTAAA", "2710": "TTTAAT", "2711": "TTTAAG", "2712": "TTTAAC", "2713": "TTTATA", "2714": "TTTATT", "2715": "TTTATG", "2716": "TTTATC", "2717": "TTTAGA", "2718": "TTTAGT", "2719": "TTTAGG", "2720": "TTTAGC", "2721": "TTTACA", "2722": "TTTACT", "2723": "TTTACG", "2724": "TTTACC", "2725": "TTTTAA", "2726": "TTTTAT", "2727": "TTTTAG", "2728": "TTTTAC", "2729": "TTTTTA", "2730": "TTTTTT", "2731": "TTTTTG", "2732": "TTTTTC", "2733": "TTTTGA", "2734": "TTTTGT", "2735": "TTTTGG", "2736": "TTTTGC", "2737": "TTTTCA", "2738": "TTTTCT", "2739": "TTTTCG", "2740": "TTTTCC", "2741": "TTTGAA", "2742": "TTTGAT", "2743": "TTTGAG", "2744": "TTTGAC", "2745": "TTTGTA", "2746": "TTTGTT", "2747": "TTTGTG", "2748": "TTTGTC", "2749": "TTTGGA", "2750": "TTTGGT", "2751": "TTTGGG", "2752": "TTTGGC", "2753": "TTTGCA", "2754": "TTTGCT", "2755": "TTTGCG", "2756": "TTTGCC", "2757": "TTTCAA", "2758": "TTTCAT", "2759": "TTTCAG", "2760": "TTTCAC", "2761": "TTTCTA", "2762": "TTTCTT", "2763": "TTTCTG", "2764": "TTTCTC", "2765": "TTTCGA", "2766": "TTTCGT", "2767": "TTTCGG", "2768": "TTTCGC", "2769": "TTTCCA", "2770": "TTTCCT", "2771": "TTTCCG", "2772": "TTTCCC", "2773": "TTGAAA", "2774": "TTGAAT", "2775": "TTGAAG", "2776": "TTGAAC", "2777": "TTGATA", "2778": "TTGATT", "2779": "TTGATG", "2780": "TTGATC", "2781": "TTGAGA", "2782": "TTGAGT", "2783": "TTGAGG", "2784": "TTGAGC", "2785": "TTGACA", "2786": "TTGACT", "2787": "TTGACG", "2788": "TTGACC", "2789": "TTGTAA", "2790": "TTGTAT", "2791": "TTGTAG", "2792": "TTGTAC", "2793": "TTGTTA", "2794": "TTGTTT", "2795": "TTGTTG", "2796": "TTGTTC", "2797": "TTGTGA", "2798": "TTGTGT", "2799": "TTGTGG", "2800": "TTGTGC", "2801": "TTGTCA", "2802": "TTGTCT", "2803": "TTGTCG", "2804": "TTGTCC", "2805": "TTGGAA", "2806": "TTGGAT", "2807": "TTGGAG", "2808": "TTGGAC", "2809": "TTGGTA", "2810": "TTGGTT", "2811": "TTGGTG", "2812": "TTGGTC", "2813": "TTGGGA", "2814": "TTGGGT", "2815": "TTGGGG", "2816": "TTGGGC", "2817": "TTGGCA", "2818": "TTGGCT", "2819": "TTGGCG", "2820": "TTGGCC", "2821": "TTGCAA", "2822": "TTGCAT", "2823": "TTGCAG", "2824": "TTGCAC", "2825": "TTGCTA", "2826": "TTGCTT", "2827": "TTGCTG", "2828": "TTGCTC", "2829": "TTGCGA", "2830": "TTGCGT", "2831": "TTGCGG", "2832": "TTGCGC", "2833": "TTGCCA", "2834": "TTGCCT", "2835": "TTGCCG", "2836": "TTGCCC", "2837": "TTCAAA", "2838": "TTCAAT", 